/*    
	Copyright (C) 2015  Mansur "#WASD" Taukenov
	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.
	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/
enum {
	BASKETBALL_WALK,
	BASKETBALL_RUN,
	BASKETBALL_DUNK,
	BASKETBALL_DEFENSE,
}
enum {
	ISNOT_DYNAMIC_OBJECT,
	IS_DYNAMIC_OBJECT,
}
enum {
	SDK_TEAM_1,
	SDK_TEAM_2,
}
enum {
	AREA_EASTLS,
}
enum EBallInfo {
	EBallModelID,
	EBallType,
Float:EBallX,
Float:EBallY,
Float:EBallZ,
Float:EBallRotX,
Float:EBallRotY,
Float:EBallRotZ,
	EBallVW,
	EBallInt,
	EBallObjectID,
	EBBallArea,
	EBBallOwner,
};
enum EBallBasketInfo {
	EBasketModelID,
	EBasketType,
Float:EBasketX,
Float:EBasketY,
Float:EBasketZ,
Float:EBasketRotX,
Float:EBasketRotY,
Float:EBasketRotZ,
	EBasketVW,
	EBasketInt,
	EBasketObjectID,
	EBasketTeam,
	EBasketArea,
	EBasketScore,
Text3D:EBasketText,
};
new BBallsInfo[][EBallInfo] = {
	{SDK_BASKETBALL_MDL, IS_DYNAMIC_OBJECT, 2316.94,-1527.65,24.45, 0.0, 0.0, 0.0, 0, 0, 0, AREA_EASTLS, -1}
};
new BallBasketInfo[][EBallBasketInfo] = {
	{SDK_BASKET_MDL, ISNOT_DYNAMIC_OBJECT, 2316.83, -1514.80, 28.14, 0.0, 0.0, 90.0, 0, 0, 0, SDK_TEAM_1, AREA_EASTLS, 0},
	{SDK_BASKET_MDL, ISNOT_DYNAMIC_OBJECT, 2317.03, -1541.13, 28.14, 0.0, 0.0, 90.0, 0, 0, 0, SDK_TEAM_2, AREA_EASTLS, 0}
};
new Object[9],GateOpened[8];
new tmpobjid;
//
new slotUsed[ MAX_PLAYERS char ];
new playersIP[ MAX_PLAYERS ][ 64 ];
//
// Тюнинг
new _TuningPriceWheels[8],
	_TuningPriceSpoilers[2],
	_TuningPriceHydraulics,
	_TuningPriceHBumper[2],
	_TuningPriceBBumper[2],
	_TuningPriceNitro[3],
	_TuningPriceNeons[5]
;
new dmv[5];
new maskuse[MAX_PLAYERS],MaskTimer[MAX_PLAYERS];
enum ObjInv
{
	obiDrop[2],
Float:obiDropPos[3],
	obiObject,
};
new ObjectInv[MAX_OBJECT][ObjInv];
enum invPlayer
{
	invName[50],
	invSize,
	invObject,
	invText[200],
	Float:POSTDx,
	Float:POSTDy,
	Float:POSTDz,
	Float:POSTDc
};
new Items_All[ALL_ITEMS_SIZE][invPlayer] = {
	{"Пусто",0,19461,"", 0.000000, 0.000000, 0.000000, 88.000000},
	{"Аптечка",1,1240,"Прибавляет +40 к Вашему здоровью", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Часы",2,19039,"Хотите узнать сколько время? Эта штука поможет вам!", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Маска",3,19163,"Скрывает ваше месторасположение на радаре", 0.000000, 0.000000, 90.000000, 1.000000},
	{"Лимонад",4,1546,"Прибавляет +10 к Вашему здоровью и уталяет жажду", 0.000000, 0.000000, 90.000000, 1.000000},
	{"Щит",5,18637,"", 90.000000, 0.000000, 0.000000, 1.000000},
	{"Коробка с пиццей",6,2814,"Прибавляет +20 к Вашей сытости", 270.000000, 0.000000, 0.000000, 1.000000},
	{"Гамбургер в упаковке",7,2768,"Прибавляет +20 к Вашей сытости", 0.000000, 0.000000, 90.000000, 1.000000},
	{"Коробка с курицей",8,2821,"Прибавляет +20 к Вашей сытости", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Телефон",9,18874,"Вы можете вызвать скорую, механика, полицию", 90.000000, 180.000000, 0.000000, 1.000000},
	{"Военная форма",10,18924,"Вы сможете замаскироваться военным", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Клюшка для гольфа",11,333,"Ипользуется для игры в гольф, а так же как оружие ближнего боя", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Полицейская дубинка",12,334,"Используется полицейскими, при задержании кого-либо", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Охотничий нож",13,335,"Используется охотниками, для разделки животных", 0.000000, 0.000000, 0.000000, 1.700000},
	{"Бейсбольная бита",14,336,"Используется для игры в бейсбол", 0.000000, 0.000000, 0.000000, 3.000000},
	{"Большая лопата",15,337,"Используется для копания чего-либо в земле", 0.000000, 0.000000, 0.000000, 3.000000},
	{"Катана",16,339,"", 0.000000, 0.000000, 0.000000, 3.000000},
	{"Букет цветов",17,325,"Хороший подарок на свадьбу или просто так", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Пистолет 9мм",18,346,"Огнестрельное оружие с малым весом", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Пистолет 9мм ( С глушителем )",19,347,"Огнестрельное, тихое оружие с малым весом", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Пустынный Орёл",20,348,"Огнестрельное, мощное оружие с малым весом", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Дробовик 'Shotgun'",21,349,"", 0.000000, 0.000000, 0.000000, 2.100000},
	{"Дробовик 'Combat Shotgun'",22,351,"", 0.000000, 0.000000, 0.000000, 2.100000},
	{"Пистолет - пулимёт 'Micro UZI'",23,352,"", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Пистолет - пулимёт 'MP5'",24,353,"", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Пистолет - пулимёт 'Tec 9'",25,372,"", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Штурмовая винтовка 'AK-47'",26,355,"", 0.000000, 0.000000, 0.000000, 2.300000},
	{"Штурмовая винтовка 'M4'",27,356,"", 0.000000, 0.000000, 0.000000, 2.300000},
	{"Охотнячья винтовка",28,357,"", 0.000000, 0.000000, 0.000000, 2.300000},
	{"Снайперская винтовка",29,358,"", 0.000000, 0.000000, 0.000000, 2.300000},
	{"Парашют",30,371,"", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Балончик с краской",31,365,"", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Огнетушитель",32,366,"", 0.000000, 0.000000, 0.000000, 2.000000},
	{"Фото-камера",33,367,"", 0.000000, 0.000000, 30.000000, 1.000000},
	{"Бронежилет",34,1242,"Защитный комплект", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Наркотики",35,1580,"Группа веществ различной природы", 90.000000, 0.000000, 0.000000, 1.000000},
	{"Металл",36,1252,"", 0.000000, 0.000000, 90.000000, 1.000000},
	{"Патроны",37,2061,"", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Зерна",38,19063,"", 0.000000, 0.000000, 0.000000, 1.000000},
	{"Канистра",39,1650,"Прибавляет +50 бензина в автомобиль", 0.000000, 0.000000, 0.000000, 1.000000}
};
new Float:DamageHealth[MAX_PLAYERS];
new Float:DamageArmour[MAX_PLAYERS];
new ResetShield[MAX_PLAYERS];
new AmmoPickup[MAX_VEHICLES];
new Text3D:AmmoText[MAX_VEHICLES];
new loadtimers;
new loadtimer;
new Start[MAX_VEHICLES];
enum pAmmoLoad {
	gBallas,
	gVagos,
	gGrove,
	gAztek,
	gRifa,
};
new LoadAmmoInfo[1][pAmmoLoad];
//
new Slots[MAX_PLAYERS][3];
new SlotCounter[MAX_PLAYERS];
new Gambling[MAX_PLAYERS];
new SlotTimer[MAX_PLAYERS];
new ZapretDice[MAX_PLAYERS];
new KostiName[MAX_PLAYERS];
new KostiMoney[MAX_PLAYERS];
//
new WeaponNames[][32] = {
	{"Unarmed (Fist)"}, // 0
	{"Brass Knuckles"}, // 1
	{"Golf Club"}, // 2
	{"Night Stick"}, // 3
	{"Knife"}, // 4
	{"Baseball Bat"}, // 5
	{"Shovel"}, // 6
	{"Pool Cue"}, // 7
	{"Katana"}, // 8
	{"Chainsaw"}, // 9
	{"Purple Dildo"}, // 10
	{"Big White Vibrator"}, // 11
	{"Medium White Vibrator"}, // 12
	{"Small White Vibrator"}, // 13
	{"Flowers"}, // 14
	{"Cane"}, // 15
	{"Grenade"}, // 16
	{"Teargas"}, // 17
	{"Molotov"}, // 18
	{"unknown"}, // 19
	{"unknown"}, // 20
	{"unknown"}, // 21
	{"Colt 45"}, // 22
	{"Colt 45 (Silenced)"}, // 23
	{"Desert Eagle"}, // 24
	{"Normal Shotgun"}, // 25
	{"Sawnoff Shotgun"}, // 26
	{"Combat Shotgun"}, // 27
	{"Micro Uzi (Mac 10)"}, // 28
	{"MP5"}, // 29
	{"AK47"}, // 30
	{"M4"}, // 31
	{"Tec9"}, // 32
	{"Country Rifle"}, // 33
	{"Sniper Rifle"}, // 34
	{"Rocket Launcher"}, // 35
	{"Heat-Seeking Rocket Launcher"}, // 36
	{"Flamethrower"}, // 37
	{"Minigun"}, // 38
	{"Satchel Charge"}, // 39
	{"Detonator"}, // 40
	{"Spray Can"}, // 41
	{"Fire Extinguisher"}, // 42
	{"Camera"}, // 43
	{"Night Vision Goggles"}, // 44
	{"Infrared Vision Goggles"}, // 45
	{"Parachute"}, // 46
	{"Fake Pistol"} // 47
};
//
new SVGuns = 0;
new Float:gSeloCP[5][3] = {
	{-38.4844,-183.0430,928.7820},
	{-33.0433,-175.2912,928.7820},
	{-43.9650,-168.6770,928.7820},
	{-32.8986,-160.1485,928.7820},
	{-43.6799,-160.1498,928.7820}
};
enum AC_p {
	pMod[15], Float:pClicked[3]
};
new AC_PI[MAX_PLAYERS][AC_p];
new NoReloading[MAX_PLAYERS];
new CurrentWeapon[MAX_PLAYERS];
new CurrentAmmo[MAX_PLAYERS];
new TIMER_Spawn[MAX_PLAYERS];
new Float:AutoHelti[MAX_PLAYERS];
new Float:SpeedM[3][MAX_PLAYERS];
new Float:LastPos[3][MAX_PLAYERS];
new BanWeap[] = { 35, 36, 37, 38, 44, 45};
//
new Iterator:StreamedPlayers[MAX_PLAYERS]<MAX_PLAYERS-1>;
new Iterator:MAX_CARS<MAX_VEHICLES>;
new engine,lights,alarm,doors,bonnet,boot,objective;
new WebSites[][] ={".ws",".ru",".tk",".com","www.",".org",".net",".cc",".рф",".by",".biz",".su",".info",".ga",".ml",".es",".ua",":7777"};
new delimiters[]={'.', ' ', ',', '*', '/', ';', '\\', '|','_', 'ю'};
//
new cfindtimer[MAX_PLAYERS];
new cgangzone[MAX_PLAYERS];
//
new Menu:SkinMenu,Menu:ShopMenu;
//
new rock_a[MAX_PLAYERS];
new timer_rock;
new worldcar[MAX_PLAYERS];
new MafiaZone[1];
//
new IDVEH[MAX_PLAYERS];
new OLDIDVEH[MAX_PLAYERS];
new CarTPWarn[MAX_PLAYERS];
new AntiTPTimer[MAX_PLAYERS];
new OpenedMM[MAX_PLAYERS];
new AdvertTime;
new NewsPrice[40],CallPrice[2], SmsPrice[2];
new SmsNews[2];
new CallNews[2];
//
new TicketOffer[MAX_PLAYERS];
new TicketMoney[MAX_PLAYERS];
new Text3D:GruzText[1];
new Text3D:WareHouse[12];
new Text3D:MedHealText3D[15];
new Text3D:TaxiText3D[MAX_PLAYERS];
new Text3D:BusText3D[MAX_PLAYERS];
//
new CheckHealArmour[MAX_PLAYERS];
new Float:PlayerArmor[MAX_PLAYERS];
new GunCheckTime[MAX_PLAYERS];
new ToCallTime[MAX_PLAYERS];
new ReFuelTimer[MAX_PLAYERS];
new PlayerHealP[MAX_PLAYERS] = 200;
new BuyVeh[MAX_PLAYERS];
new ColorVeh[MAX_PLAYERS][2];
new SetColor[MAX_PLAYERS];
new CheckNewBank[MAX_PLAYERS];
new InShop[MAX_PLAYERS];
new InTuning[MAX_PLAYERS];
new CellTime[MAX_PLAYERS] = -1;
new Mobile[MAX_PLAYERS];
new STimer[MAX_PLAYERS];
new SendAdmin[MAX_PLAYERS];
new SendHelper[MAX_PLAYERS];
new VehTest[MAX_PLAYERS];
new ClothesRound[MAX_PLAYERS];
new SelectCharPlace[MAX_PLAYERS];
new InShopSkin[MAX_PLAYERS];
new EnterTimer[MAX_PLAYERS];
new DerevoTimer[MAX_PLAYERS];
new bool:PlayerLogged[MAX_PLAYERS];
new PlayerRegs[MAX_PLAYERS];
new PlayerLogin[MAX_PLAYERS];
new PlayerLogins[2][MAX_PLAYERS];
new PlayerRegister[3][MAX_PLAYERS];
new SendFamily[MAX_PLAYERS];
new PlayerLastTick[MAX_PLAYERS];
new animlib[MAX_PLAYERS][30], animname[MAX_PLAYERS][30];
new pPressed[MAX_PLAYERS];
new Fuel[MAX_VEHICLES];
///
new LicPrices[120];
new FracPays[120];
new LicPrice[5];
new SAMoney,FracPay[20];
///
new ToCall[4] = -1;
new years, months, days;
//
enum gtInfo
{
	gtID,
	gtGoID,
Float:gtX,
Float:gtY,
Float:gtZ,
Float:gtTPX,
Float:gtTPY,
Float:gtTPZ,
	gtState,
	gtStayed
}
new GotoInfo[MAX_PLAYERS][gtInfo];
new VehicleSeat[MAX_VEHICLES][10];
//
new GetPlayerTransfer[MAX_PLAYERS];
new ReconTimer;
new TimeActive[MAX_PLAYERS];
//
new VehicleNameS[][] = {
	"Landstalker", "Bravura", "Buffalo", "Linerunner", "Perrenial", "Sentinel",
	"Dumper", "Firetruck", "Trashmaster", "Stretch", "Manana", "Infernus",
	"Voodoo", "Pony", "Mule", "Cheetah", "Ambulance", "Leviathan", "Moonbeam",
	"Esperanto", "Taxi", "Washington", "Bobcat", "Whoopee", "BF Injection",
	"Hunter", "Premier", "Enforcer", "Securicar", "Banshee", "Predator", "Bus",
	"Rhino", "Barracks", "Hotknife", "Trailer", "Previon", "Coach", "Cabbie",
	"Stallion", "Rumpo", "RC Bandit", "Romero", "Packer", "Monster", "Admiral",
	"Squalo", "Seasparrow", "Pizzaboy", "Tram", "Trailer", "Turismo", "Speeder",
	"Reefer", "Tropic", "Flatbed", "Yankee", "Caddy", "Solair", "Berkley's RC Van",
	"Skimmer", "PCJ-600", "Faggio", "Freeway", "RC Baron", "RC Raider", "Glendale",
	"Oceanic","Sanchez", "Sparrow", "Patriot", "Quad", "Coastguard", "Dinghy",
	"Hermes", "Sabre", "Rustler", "ZR-350", "Walton", "Regina", "Comet", "BMX",
	"Burrito", "Camper", "Marquis", "Baggage", "Dozer", "Maverick", "News Chopper",
	"Rancher", "FBI Rancher", "Virgo", "Greenwood", "Jetmax", "Hotring", "Sandking",
	"Blista Compact", "Police Maverick", "Boxvillde", "Benson", "Mesa", "RC Goblin",
	"Hotring Racer A", "Hotring Racer B", "Bloodring Banger", "Rancher", "Super GT",
	"Elegant", "Journey", "Bike", "Mountain Bike", "Beagle", "Cropduster", "Stunt",
	"Tanker", "Roadtrain", "Nebula", "Majestic", "Buccaneer", "Shamal", "Hydra",
	"FCR-900", "NRG-500", "HPV1000", "Cement Truck", "Tow Truck", "Fortune",
	"Cadrona", "FBI Truck", "Willard", "Forklift", "Tractor", "Combine", "Feltzer",
	"Remington", "Slamvan", "Blade", "Freight", "Streak", "Vortex", "Vincent",
	"Bullet", "Clover", "Sadler", "Firetruck", "Hustler", "Intruder", "Primo",
	"Cargobob", "Tampa", "Sunrise", "Merit", "Utility", "Nevada", "Yosemite",
	"Windsor", "Monster", "Monster", "Uranus", "Jester", "Sultan", "Stratium",
	"Elegy", "Raindance", "RC Tiger", "Flash", "Tahoma", "Savanna", "Bandito",
	"Freight Flat", "Streak Carriage", "Kart", "Mower", "Dune", "Sweeper",
	"Broadway", "Tornado", "AT-400", "DFT-30", "Huntley", "Stafford", "BF-400",
	"News Van", "Tug", "Trailer", "Emperor", "Wayfarer", "Euros", "Hotdog", "Club",
	"Freight Box", "Trailer", "Andromada", "Dodo", "RC Cam", "Launch", "Police Car",
	"Police Car", "Police Car", "Police Ranger", "Picador", "S.W.A.T", "Alpha",
	"Phoenix", "Glendale", "Sadler", "Luggage", "Luggage", "Stairs", "Boxville",
	"Tiller", "Utility Trailer"
};
new Cars_C[68][2]={
	{495,450000},
	{496,150000},
	{402,480000},
	{506,500000},
	{507,175000},
	{516,75000},
	{517,74000},
	{518,64000},
	{521,315000},
	{526,75000},
	{527,68000},
	{529,71000},
	{533,175000},
	{534,181000},
	{535,175000},
	{540,74000},
	{541,475000},
	{542,65000},
	{543,61000},
	{545,205000},
	{546,97000},
	{547,90000},
	{549,105000},
	{550,102000},
	{551,92000},
	{554,105000},
	{555,115000},
	{558,235000},
	{559,270000},
	{560,300000},
	{565,285000},
	{566,85000},
	{567,121000},
	{575,175000},
	{576,77000},
	{579,210000},
	{580,245000},
	{581,175000},
	{585,81000},
	{586,74000},
	{587,287000},
	{589,185000},
	{602,130000},
	{603,250000},
	{400,65000},
	{401,55000},
	{404,59000},
	{405,75000},
	{410,55000},
	{412,63000},
	{415,345000},
	{418,56000},
	{419,67000},
	{424,256000},
	{422,86000},
	{421,150000},
	{426,81000},
	{429,295000},
	{451,475000},
	{461,164000},
	{468,60000},
	{475,78000},
	{477,230000},
	{478,65000},
	{480,415000},
	{483,115000},
	{489,135000},
	{492,82000}
};

new CpWareHouse[5];
new CpSlotM[5];
new CpGunArmy[1];
new CpJobs[1];
new ePickup[1];
new BuyMetall;
new HotelPick;
new cJobPick[2];
new FarmPick[2];
new Metal[12], Mats[12], Drugs[12], MBank[4];
new ArmyMats[2];
new PDcar[22],LVPDcar[2],SFPDcar[2],ArmyCar[2],VMFCar[2];
new GangCar[10],GangAmmoCar[5];
new ArmyMatCar[2];
new RentBike[2];
new GetGun[7];
new FoodPick;
new Puclic[114];
new Chocones[246];
new Derbycar[12];
new point[20];
// PD двери
#define PD_DOOR_COUNT 6
#define PD_DOOR_SPEED 0.8
#define PD_DOOR_DELAY 5000

new Float:camSpawn[3][4] = {
	{1611.3727,-1632.6846,1584.3660,270.0},
	{1608.4061,-1632.6017,1584.3660,0.0},
	{1611.1234,-1625.7957,1584.3660,270.0}
};

new gPDDoors[PD_DOOR_COUNT][3];
new gPDDoorButton[PD_DOOR_COUNT];
new Float:gPDDoorOPos[PD_DOOR_COUNT][6] = {
	{1640.74, -1630.95, 1582.80, 0.0, 0.0, 0.0},
	{1622.06, -1631.34, 1582.80, 0.00, 0.00, 90.00},
	{1618.50, -1631.29, 1582.80, 0.00, 0.00, 90.00},
	{1613.81, -1630.16, 1584.11,   0.00, 0.00, 62.00},
	{1611.00, -1628.86, 1584.11,   0.00, 0.00, -33.00},
	{1614.73, -1628.27, 1584.11,   0.00, 0.00, -120.00}
};
new Float:gPDDoorCPos[PD_DOOR_COUNT][6] = {
	{1642.08, -1630.95, 1582.80, 0.0, 0.0, 0.0},
	{1622.06, -1629.98, 1582.80, 0.00, 0.00, 90.00},
	{1618.50, -1629.97, 1582.80, 0.00, 0.00, 90.00},
	{1614.30, -1630.91, 1584.11, 0.00, 0.00, 0.00},
	{1610.29, -1629.28, 1584.11, 0.00, 0.00, -90.00},
	{1614.30, -1627.51, 1584.11, 0.00, 0.00, -180.00}
};
new gPDCamArea[3];

#define FRACTION_COUNT 18
new Fraction[FRACTION_COUNT][34] = {"Правительство","SAPD","SAN","Военно-морской Флот","Больница LS","The Grove Street","The Ballas","Varios Los Aztecas","The Vagos","The Rifa","FBI","Автошкола","Сухопутные Войска","SFPD","LVPD","Больница SF","Больница LV","Колумбийский наркокортель"};
new FractionSkin[FRACTION_COUNT][15] = {
	{59,98,163,164,187,141,216,147,0,0,0,0}, // Мэрия
	{93,192,211,265,266,267,280,282,283,284,285,0}, //SAPD
	{188,219,223,224,225,250,263,0,0,0,0,0}, // SAN
	{61,191,255,287,0,0,0,0,0,0,0,0}, // ВМФ
	{70,71,274,275,276,148,76,0,0,0,0,0}, // МЧС LS
	{86,105,106,107,149,195,269,270,271,0,0,0}, // Grove
	{102,103,104,195,13,0,0,0,0,0,0,0}, // Ballas
	{114,115,116,193,0,0,0,0,0,0,0,0}, // Aztecas
	{108,109,110,190,0,0,0,0,0,0,0,0}, // Vagos
	{173,174,175,56,0,0,0,0,0,0,0,0}, // Rifa
	{286,163,164,165,166,0,0,0,0,0,0,0}, // FBI
	{59,172,189,240,0,0,0,0,0,0,0,0}, // Автошкола
	{287,61,121,179,191,285,0,0,0,0,0,0},// СВ
	{93,192,211,265,266,267,280,282,283,284,285,0},//SFPD
	{93,192,211,265,266,267,280,282,283,284,285,0},//LVPD
	{70,71,274,275,276,148,76,0,0,0,0,0},//МЧС SF
	{70,71,274,275,276,148,76,0,0,0,0,0},//МЧС LV
	{146,144,143,221,297,0,0,0,0,0,0,0}//Колумбийский наркокортель
};
new CountRank[FRACTION_COUNT] = {9,11,10,17,11,10,10,10,10,10,12,11,13,10,10,10};
new FractionRank[FRACTION_COUNT][17][39] = {
	{"Телохранитель","Начальник охраны","Секретарь","Ст. Секретарь","Помощник прокурора","Прокурор","Глава отдела кадров","Вице-Мэр","Мэр","","","","","","","",""},
	{"Курсант","Рядовой","Сержант","Ст.Сержант","Лейтенант","Ст.Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф","","","","","",""},
	{"Помощник редакции","Фотограф","Оператор","Репортёр","Журналист","Корреспондент","Редактор","Гл.редактор","Директор","Ген. Директор","","","","","","",""},
	{"Матрос","Старший матрос","Старшина 2 статьи","Старшина 1 статьи","Главный старшина","Главный корабельный старшина","Младший лейтенант","Лейтенант","Старший лейтенант","Капитан лейтенант","Капитан 3 ранга","Капитан 2 ранга","Капитан 1 ранга","Контр-Адмирал","Вице-Адмирал","Адмирал","Адмирал флота"},
	{"Интерн","Психолог","Врач-нарколог","Врач-участковый","Врач-терапевт","Врач-хирург","Младший специалист","Старший специалист","Заведующий отделением","Глав-врач","Министр З.Х","","","","","",""},
	{"Плейя","Хастла","Килла","Юонг","Гангста","О.Г","Мобста","Де Кинг","Легенд","Мэд Дог","","","","","","",""},
	{"Блайд","Бастер","Крекер","Гун Бро","Ап Бро","Гангстер","Федерал Блок","Фолкс","Райч Нига","Биг Вилли","","","","","","",""},
	{"Перро","Тирадор","Геттор","Лас Герас","Мирандо","Сабио","Инвасор","Тессореро","Нестро","Падре","","","","","","",""},
	{"Навато","Ординаро","Локал","Вирификадо","V.E.G","Ассесино","Бандито","Лидер V.E.G","Проксимо","Падре","","","","","","",""},
	{"Новато","Ладрон","Амиго","Мачo","Джуниор","Эрмано","Бандидо","Ауторидад","Аджунто","Падре","","","","","","",""},
	{"Стажер","Младший агент","Агент","Старший агент","Специальный агент","Старший специальный агент","Уполномоченный специальный агент","Управляющий Академией","Заместитель начальника отдела","Начальник отдела","Заместитель Начальника Департамента","Начальник Департамента","","","","",""},
	{"Стажёр","Консультант","Экзаменатор","Инструктор","Кординатор","Мл.Менеджер","Ст.Менеджер","Директор","Управляющий","","","","","","","",""},
	{"Рядовой","Мл.Сержант","Сержант","Ст.Сержант","Старшина","Мл.Лейтенант","Лейтенант","Ст.Лейтенант","Капитан","Майор","Подпокловник","Полковник","Генерал армии","","","",""},
	{"Курсант","Рядовой","Сержант","Ст.Сержант","Лейтенант","Ст.Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф","","","","","",""},
	{"Курсант","Рядовой","Сержант","Ст.Сержант","Лейтенант","Ст.Лейтенант","Капитан","Майор","Подполковник","Полковник","Шериф","","","","","",""},
	{"Интерн","Психолог","Врач-нарколог","Врач-участковый","Врач-терапевт","Врач-хирург","Младший специалист","Старший специалист","Заведующий отделением","Глав-врач","Министр З.Х","","","","","",""},
	{"Интерн","Психолог","Врач-нарколог","Врач-участковый","Врач-терапевт","Врач-хирург","Младший специалист","Старший специалист","Заведующий отделением","Глав-врач","Министр З.Х","","","","","",""},
	{"Новичек","Проверенный","Боец","Торговец","Убийца","Советник","Правая рука","Босс","","","","","","","","",""}
};
// Спавны
new Float:FractionSpawn[FRACTION_COUNT][5] = {
	{1468.9159,-1369.6263,46.9359}, //Мэрия
	{1634.1458,-1622.8223,1583.8660}, //SAPD
	{-1752.0259,2623.8088,62.6159}, //SAN
	{-1348.1842,494.1925,11.1953}, //Армия
	{-2630.9917,-1654.4131,1660.2419}, //МЧС LS
	{2487.4324,-1717.3076,1154.5859}, //Grove
	{2065.3738,-1173.5222,1151.0859}, //Ballas
	{1862.5131,-2041.8707,1051.0859}, //Aztecas
	{2433.3535,-1093.8359,1051.0859}, //Vagos
	{2510.2427,-1536.0934,1523.5559}, //Rifa
	{324.4429,283.9395,1007.3959}, //FBI
	{1122.8422,1262.4427,10.9078}, //Licensers
	{-1818.7126,2976.6365,1514.3453}, //Армия
	{1634.1458,-1622.8223,1583.8660},//sfpd
	{1634.1458,-1622.8223,1583.8660},//lvpd
	{302.9756,184.5546,944.0239},//МЧС SF
	{302.9756,184.5546,944.0239},//МЧС LV
	{302.9756,184.5546,944.0239}//Колумбийский наркокортель
};
new FractionSpawnData[FRACTION_COUNT][2] = {
	{0,0}, // Мэрия
	{6,1}, // SAPD
	{4,2}, // SAN
	{0,0}, // Army
	{1,1}, // МЧС LS
	{5,1}, // Groove
	{5,2}, // Ballas
	{5,3}, // Aztecas
	{5,4}, // Vagos
	{5,5}, // Rifa
	{3,1}, // FBI
	{2,2}, // Licensers
	{10,1}, // Сухопутные Войска
	{6,2}, // SAPD
	{6,3}, // SAPD
	{1,1}, // МЧС SF
	{1,1}, // МЧС LV
	{0,0} //Колумбийский наркокортель
};
// Высота - 1659.213
new Float:InMedHeal[][15] = {
	{-2620.0447,-1648.4487,1660.2429},
	{-2617.5059,-1648.4617,1660.2429},
	{-2617.3281,-1643.7859,1660.2429},
	{-2620.0676,-1643.7590,1660.2429},
	{-2631.3516,-1645.7960,1660.2429},
	{-2631.4871,-1641.5680,1660.2429},
	{-2628.6802,-1641.6355,1660.2429},
	{-2628.7898,-1639.4006,1660.2429},
	{-2631.5242,-1639.4382,1660.2429},
	{-2631.6609,-1633.9238,1660.2429},
	{-2628.7437,-1633.5985,1660.2429},
	{-2620.2622,-1636.0217,1660.2429},
	{-2617.6187,-1636.2188,1660.2429},
	{-2620.3760,-1641.6199,1660.2429},
	{-2617.7283,-1641.4946,1660.2429}
};
//
new spect[128];
new NeonObject[MAX_PLAYERS][2];
//
new GambK[MAX_PLAYERS];
// ПИРС
enum pirsInfoEnum {
	statusp,
	renter[24],
Text3D: renter_3d
};
new pirsinfo[MAX_PIRS][pirsInfoEnum];
new pickup_krubjob;
new Float: coordinationPirs[MAX_PIRS][3] = {
	{-27.9312,-1604.5620,1.9465},
	{-42.8618,-1615.1226,1.9465},
	{-57.4958,-1630.0460,1.9465},
	{-74.4600,-1643.1355,1.9465}

};
new Float: coordinationWaterPirs[MAX_PIRS][3] = {
	{-26.2132,-1610.0668,-0.2338},
	{-41.0500,-1621.7843,-0.4182},
	{-55.6836,-1635.6711,-0.3156},
	{-73.1969,-1648.5662,-0.1637}
};
new Float: krub_marshruts[3][6][3];
new objects_krubjob[MAX_PLAYERS][11];
new objectsOnCar_krubjob[MAX_PLAYERS][6];
new Float: coordinationObjectOnCar[6][3] = {
	{-0.804999, -3.555033, 0.000000},
	{0.724999, -3.535033, 0.000000},
	{0.724999, -3.535033, 0.929999},
	{-0.879999, -3.535033, 0.929999},
	{-0.779999, -2.069999, 0.000000},
	{-0.779999, -2.069999, 0.904999}
};
new PlayerBar:boxygen[MAX_PLAYERS] = INVALID_PLAYER_BAR_ID;

new krub_car[MAX_PIRS];
new PirsTable[4];
new midias[2];
//
new selectcar[MAX_PLAYERS];
new caringarage[MAX_PLAYERS];
new AmountLBizz[MAX_PLAYERS][2];
// Сад
new GardenSys;
new GardenBObjects[2][34];
new Text3D:GardenCText[2];
new GardenSmallCar;
new GardenWaterTruck;
new GardenCarsIs[2][2];
new GardenCPicks[2];
new GardenCheckpoints[76];
new GardenTreesIs[76];
new GardenTreesIDs[76][2];
new Float:GardenTrees[76][3] = {
	{-1123.4193115,-1216.7835693,126.4688034},// (3)
	{-1123.0939941,-1209.0327148,126.4688034},// (5)
	{-1122.6330566,-1200.8920898,126.4688034},// (6)
	{-1122.2612305,-1192.8942871,126.4688034},// (7)
	{-1122.5588379,-1184.8129883,126.4688034},// (8)
	{-1122.8535156,-1176.4050293,126.4688034},// (9)
	{-1122.7016602,-1168.6076660,126.4688034},// (10)
	{-1131.7011719,-1168.6074219,126.4688034},// (11)
	{-1141.7011719,-1168.6074219,126.4688034},// (12)
	{-1150.7011719,-1168.6074219,126.4688034},// (13)
	{-1160.2011719,-1168.6074219,126.4688034},// (14)
	{-1170.7011719,-1168.6074219,126.4688034},// (15)
	{-1180.2011719,-1168.6074219,126.4688034},// (16)
	{-1189.9511719,-1168.6074219,126.4688034},// (17)
	{-1131.6035156,-1176.4769287,126.4688034},// (18)
	{-1141.6035156,-1176.5595703,126.4688034},// (19)
	{-1150.6035156,-1176.6342773,126.4688034},// (20)
	{-1160.1035156,-1176.7126465,126.4688034},// (21)
	{-1170.8535156,-1176.8011475,126.4688034},// (22)
	{-1180.1035156,-1176.8775635,126.4688034},// (23)
	{-1189.8535156,-1176.9578857,126.4688034},// (24)
	{-1122.5585938,-1184.8125000,126.4688034},// (26)
	{-1131.3085938,-1184.8082275,126.4688034},// (27)
	{-1141.3085938,-1184.8027344,126.4688034},// (28)
	{-1150.8085938,-1184.7980957,126.4688034},// (29)
	{-1160.0585938,-1184.7933350,126.4688034},// (30)
	{-1170.5585938,-1184.7878418,126.4688034},// (31)
	{-1179.3085938,-1184.7828369,126.4688034},// (32)
	{-1190.3085938,-1184.7768555,126.4688034},// (33)
	{-1190.3125000,-1192.7763672,126.4688034},// (34)
	{-1180.0625000,-1192.7813721,126.4688034},// (35)
	{-1170.8125000,-1192.7857666,126.4688034},// (36)
	{-1160.0625000,-1192.7904053,126.4688034},// (37)
	{-1151.3125000,-1192.7943115,126.4688034},// (38)
	{-1140.8125000,-1192.7990723,126.4688034},// (39)
	{-1131.5625000,-1192.8033447,126.4688034},// (40)
	{-1131.5665283,-1201.0527344,126.4688034},// (41)
	{-1140.8164062,-1201.0482178,126.4688034},// (42)
	{-1151.5664062,-1201.0426025,126.4688034},// (43)
	{-1161.0664062,-1201.0373535,126.4688034},// (44)
	{-1170.5664062,-1201.0324707,126.4688034},// (45)
	{-1180.0664062,-1201.0275879,126.4688034},// (46)
	{-1190.5664062,-1201.0222168,126.4688034},// (47)
	{-1190.5701904,-1208.7714844,126.4688034},// (48)
	{-1180.3193359,-1208.7764893,126.4688034},// (49)
	{-1171.0693359,-1208.7808838,126.4688034},// (50)
	{-1161.3193359,-1208.7850342,126.4688034},// (51)
	{-1151.8193359,-1208.7888184,126.4688034},// (52)
	{-1140.8193359,-1208.7934570,126.4688034},// (53)
	{-1131.8193359,-1208.7973633,126.4688034},// (54)
	{-1131.8232422,-1216.7968750,126.4688034},// (55)
	{-1141.0732422,-1216.7923584,126.4688034},// (56)
	{-1152.0732422,-1216.7866211,126.4688034},// (57)
	{-1161.5732422,-1216.7814941,126.4688034},// (58)
	{-1171.5732422,-1216.7763672,126.4688034},// (59)
	{-1180.8232422,-1216.7718506,126.4688034},// (60)
	{-1191.3232422,-1216.7663574,126.4688034},// (61)
	{-1201.0732422,-1216.7608643,126.4688034},// (62)
	{-1201.0690918,-1208.2607422,126.4688034},// (63)
	{-1201.0646973,-1200.7607422,126.4688034},// (64)
	{-1201.0607910,-1193.2607422,126.4688034},// (65)
	{-1201.0566406,-1185.2607422,126.4688034},// (66)
	{-1201.0528564,-1177.5107422,126.4688034},// (67)
	{-1201.0483398,-1168.5107422,126.4688034},// (68)
	{-1201.2851562,-1159.0510254,126.4688034},// (77)
	{-1190.2851562,-1159.0561523,126.4688034},// (78)
	{-1180.2851562,-1159.0605469,126.4688034},// (79)
	{-1171.0351562,-1159.0650635,126.4688034},// (80)
	{-1160.5351562,-1159.0695801,126.4688034},// (81)
	{-1151.0351562,-1159.0739746,126.4688034},// (82)
	{-1142.2851562,-1159.0775146,126.4688034},// (83)
	{-1132.0351562,-1159.0821533,126.4688034},// (84)
	{-1123.7851562,-1159.0860596,126.4688034},// (85)
	{-1113.4187012,-1159.7609863,126.4688034},// (86)
	{-1103.8361816,-1160.0635986,126.4688034},// (87)
	{-1095.0059814,-1160.4180908,126.4688034}// (88)
};
// Колхоз
new Float:Combain_1[][3] = {
	{-130.9457,41.2838,2.8443},
	{-117.1892,102.4194,2.8443},
	{-108.7071,130.9117,2.8443},
	{-112.4468,149.2300,3.0566},
	{-133.6130,157.4933,4.1770},
	{-157.7112,165.7164,6.2740},
	{-182.8041,171.3465,8.0939},
	{-196.0091,171.4892,7.7949},
	{-207.0070,158.1177,5.2586},
	{-210.3470,144.9495,3.7375},
	{-202.0447,133.9324,3.3641},
	{-190.9380,126.1963,3.4649},
	{-173.0304,117.0940,3.1341},
	{-155.6150,111.2382,3.0279},
	{-137.8027,107.8491,2.8674},
	{-126.1331,118.2252,2.8443},
	{-120.0436,135.9439,2.8443},
	{-130.4185,149.5208,3.4828},
	{-152.4976,157.0220,5.0108},
	{-177.1668,165.3310,7.2160},
	{-193.3636,162.5962,6.5787},
	{-195.7015,149.4276,5.0935},
	{-171.7295,126.9708,3.3259},
	{-147.6406,121.4647,3.2228},
	{-134.0765,131.5029,3.1478},
	{-155.8591,147.1802,4.3019},
	{-172.5082,148.2766,5.1057},
	{-156.0887,128.7617,3.3583},
	{-121.0961,112.1554,2.8443},
	{-107.1516,142.9387,2.8417},
	{-117.7020,133.0943,2.8443},
	{-127.0757,105.4885,2.8443},
	{-129.6560,123.5969,2.8707},
	{-120.0803,151.3755,3.2827},
	{-134.1671,141.2973,3.3287},
	{-144.5762,111.4882,3.0353},
	{-149.2627,124.2978,3.2758},
	{-138.9586,153.0537,4.0584},
	{-149.5905,149.7923,4.2635},
	{-159.9886,119.6896,3.1863},
	{-164.0983,133.5519,3.4917},
	{-155.6597,157.3935,5.1791},
	{-167.6192,151.3049,5.1648},
	{-177.6511,122.8634,3.2419},
	{-179.1747,142.1797,4.8519},
	{-171.2599,165.0655,6.8737},
	{-183.1423,159.7774,6.6275},
	{-193.0166,131.0230,3.7297},
	{-194.6664,152.0045,5.3798},
	{-188.5357,169.7700,7.8010},
	{-198.8391,165.9743,6.7257},
	{-211.0462,143.3802,3.5492},
	{-200.7621,171.7351,7.5582}
};

new Float:Combain_2[][3] = {
	{-127.5285,38.6881,2.8443},
	{-143.2576,64.3301,2.8443},
	{-175.4125,77.1316,2.8443},
	{-218.7011,93.3566,2.1937},
	{-234.6992,84.7730,1.7814},
	{-255.1481,26.1301,1.8425},
	{-271.4674,-28.2111,1.8592},
	{-254.4518,-67.2636,2.8443},
	{-211.2473,-79.0819,2.8443},
	{-183.0387,-74.1084,2.8443},
	{-159.5408,-22.5576,2.8443},
	{-142.9972,18.5773,2.8443},
	{-169.2860,42.5546,2.8443},
	{-218.4272,59.9564,2.6803},
	{-233.0186,64.6427,2.1255},
	{-248.6179,19.7313,2.1317},
	{-261.0704,-24.0745,2.1854},
	{-234.9123,-46.6491,2.8443},
	{-198.0282,-59.9918,2.8443},
	{-179.2836,-35.2632,2.8443},
	{-166.1278,-1.6837,2.8443},
	{-187.9973,20.7199,2.8442},
	{-226.8455,33.8160,2.7150},
	{-248.0153,-10.2199,2.5278},
	{-230.9469,-29.8134,2.8443},
	{-205.5474,-38.2012,2.8443},
	{-184.4448,-44.8776,2.8443},
	{-185.1436,-13.8866,2.8400},
	{-207.0618,0.1091,2.8365},
	{-229.1948,9.3778,2.8443},
	{-255.8090,17.8800,1.9025},
	{-276.4517,-38.5480,1.7952},
	{-251.8427,-0.0209,2.2637},
	{-220.1065,92.2103,2.1642},
	{-226.8156,33.7539,2.7185},
	{-254.0509,-48.8833,2.8443},
	{-223.2421,-6.5238,2.8381},
	{-194.9934,78.7408,2.8443},
	{-205.4314,4.2216,2.8362},
	{-231.0802,-72.0804,2.8443},
	{-201.6557,-21.9189,2.8443},
	{-168.6997,73.2857,2.8443},
	{-178.2957,6.5109,2.8365},
	{-204.3248,-71.8462,2.8443},
	{-181.1791,-39.5055,2.8443},
	{-144.2506,64.1831,2.8443},
	{-154.2783,11.6572,2.8443},
	{-187.4592,-78.0068,2.8443},
	{-160.9245,-33.2360,2.8443},
	{-126.6606,55.1064,2.8443}
};

new Float:Combain_3[][3] = {
	{-43.8383,-89.3555,2.8443},
	{-28.9599,-47.1902,2.8443},
	{-11.4050,-7.2016,2.8443},
	{8.0473,-25.6632,2.8443},
	{31.9013,-56.3035,1.9272},
	{46.7019,-85.2065,0.3364},
	{45.9915,-105.2618,0.3439},
	{29.1215,-117.1285,0.3417},
	{1.1807,-114.1360,1.1453},
	{-32.7674,-107.6829,2.8443},
	{-29.6265,-81.2801,2.8443},
	{-20.4721,-53.6303,2.8443},
	{-13.8598,-33.6587,2.8443},
	{8.2521,-41.7090,2.8443},
	{31.1525,-71.0397,1.1335},
	{37.4018,-98.8097,0.3439},
	{1.5713,-100.6653,1.9498},
	{-30.1963,-93.6633,2.8443},
	{-15.7309,-60.2485,2.8443},
	{13.4492,-68.8684,2.5976},
	{17.8934,-88.1368,1.4140},
	{-5.8526,-88.5889,2.8175},
	{-13.0663,-7.7515,2.8443},
	{-18.9069,-34.4990,2.8443},
	{-35.8022,-88.0728,2.8443},
	{-24.8965,-77.6471,2.8443},
	{-4.7946,-17.1011,2.8443},
	{-8.5043,-56.5747,2.8443},
	{-23.3348,-107.0294,2.8443},
	{-8.2773,-84.1133,2.8443},
	{9.7677,-30.1203,2.8443},
	{7.9415,-66.0706,2.8443},
	{-5.0080,-113.0405,1.6866},
	{13.4023,-76.9250,2.1330},
	{22.1222,-47.8341,2.8443},
	{24.4490,-76.3321,1.3614},
	{14.2450,-114.9567,0.3368},
	{30.8839,-94.8228,0.3502},
	{37.2782,-73.4482,0.6027},
	{48.4938,-87.3035,0.3364},
	{43.1379,-111.3998,0.3439},
	{35.3125,-98.7780,0.3439},
	{38.7870,-71.6889,0.5629},
	{24.8994,-89.4044,0.9184},
	{16.4566,-110.4283,0.3529},
	{16.5062,-81.5700,1.7035},
	{24.2285,-45.9708,2.8443},
	{7.7389,-70.9911,2.8241},
	{-4.6728,-113.8621,1.6048},
	{-6.3559,-85.5800,2.8444},
	{9.9812,-29.4406,2.8443},
	{-13.8897,-61.1822,2.8443},
	{-28.4458,-104.5879,2.8443},
	{-42.4603,-106.3412,2.8443}
};

new Float:Tractor_1[][3] = {
	{-130.9457,41.2838,2.8443},
	{-117.1892,102.4194,2.8443},
	{-108.7071,130.9117,2.8443},
	{-112.4468,149.2300,3.0566},
	{-133.6130,157.4933,4.1770},
	{-157.7112,165.7164,6.2740},
	{-182.8041,171.3465,8.0939},
	{-196.0091,171.4892,7.7949},
	{-207.0070,158.1177,5.2586},
	{-210.3470,144.9495,3.7375},
	{-202.0447,133.9324,3.3641},
	{-190.9380,126.1963,3.4649},
	{-173.0304,117.0940,3.1341},
	{-155.6150,111.2382,3.0279},
	{-137.8027,107.8491,2.8674},
	{-126.1331,118.2252,2.8443},
	{-120.0436,135.9439,2.8443},
	{-130.4185,149.5208,3.4828},
	{-152.4976,157.0220,5.0108},
	{-177.1668,165.3310,7.2160},
	{-193.3636,162.5962,6.5787},
	{-195.7015,149.4276,5.0935},
	{-171.7295,126.9708,3.3259},
	{-147.6406,121.4647,3.2228},
	{-134.0765,131.5029,3.1478},
	{-155.8591,147.1802,4.3019},
	{-172.5082,148.2766,5.1057},
	{-156.0887,128.7617,3.3583},
	{-121.0961,112.1554,2.8443},
	{-107.1516,142.9387,2.8417},
	{-117.7020,133.0943,2.8443},
	{-127.0757,105.4885,2.8443},
	{-129.6560,123.5969,2.8707},
	{-120.0803,151.3755,3.2827},
	{-134.1671,141.2973,3.3287},
	{-144.5762,111.4882,3.0353},
	{-149.2627,124.2978,3.2758},
	{-138.9586,153.0537,4.0584},
	{-149.5905,149.7923,4.2635},
	{-159.9886,119.6896,3.1863},
	{-164.0983,133.5519,3.4917},
	{-155.6597,157.3935,5.1791},
	{-167.6192,151.3049,5.1648},
	{-177.6511,122.8634,3.2419},
	{-179.1747,142.1797,4.8519},
	{-171.2599,165.0655,6.8737},
	{-183.1423,159.7774,6.6275},
	{-193.0166,131.0230,3.7297},
	{-194.6664,152.0045,5.3798},
	{-188.5357,169.7700,7.8010},
	{-198.8391,165.9743,6.7257},
	{-211.0462,143.3802,3.5492},
	{-200.7621,171.7351,7.5582}
};

new Float:Tractor_2[][3] = {
	{-127.5285,38.6881,2.8443},
	{-143.2576,64.3301,2.8443},
	{-175.4125,77.1316,2.8443},
	{-218.7011,93.3566,2.1937},
	{-234.6992,84.7730,1.7814},
	{-255.1481,26.1301,1.8425},
	{-271.4674,-28.2111,1.8592},
	{-254.4518,-67.2636,2.8443},
	{-211.2473,-79.0819,2.8443},
	{-183.0387,-74.1084,2.8443},
	{-159.5408,-22.5576,2.8443},
	{-142.9972,18.5773,2.8443},
	{-169.2860,42.5546,2.8443},
	{-218.4272,59.9564,2.6803},
	{-233.0186,64.6427,2.1255},
	{-248.6179,19.7313,2.1317},
	{-261.0704,-24.0745,2.1854},
	{-234.9123,-46.6491,2.8443},
	{-198.0282,-59.9918,2.8443},
	{-179.2836,-35.2632,2.8443},
	{-166.1278,-1.6837,2.8443},
	{-187.9973,20.7199,2.8442},
	{-226.8455,33.8160,2.7150},
	{-248.0153,-10.2199,2.5278},
	{-230.9469,-29.8134,2.8443},
	{-205.5474,-38.2012,2.8443},
	{-184.4448,-44.8776,2.8443},
	{-185.1436,-13.8866,2.8400},
	{-207.0618,0.1091,2.8365},
	{-229.1948,9.3778,2.8443},
	{-255.8090,17.8800,1.9025},
	{-276.4517,-38.5480,1.7952},
	{-251.8427,-0.0209,2.2637},
	{-220.1065,92.2103,2.1642},
	{-226.8156,33.7539,2.7185},
	{-254.0509,-48.8833,2.8443},
	{-223.2421,-6.5238,2.8381},
	{-194.9934,78.7408,2.8443},
	{-205.4314,4.2216,2.8362},
	{-231.0802,-72.0804,2.8443},
	{-201.6557,-21.9189,2.8443},
	{-168.6997,73.2857,2.8443},
	{-178.2957,6.5109,2.8365},
	{-204.3248,-71.8462,2.8443},
	{-181.1791,-39.5055,2.8443},
	{-144.2506,64.1831,2.8443},
	{-154.2783,11.6572,2.8443},
	{-187.4592,-78.0068,2.8443},
	{-160.9245,-33.2360,2.8443},
	{-126.6606,55.1064,2.8443}
};

new Float:Tractor_3[][3] = {
	{-43.8383,-89.3555,2.8443},
	{-28.9599,-47.1902,2.8443},
	{-11.4050,-7.2016,2.8443},
	{8.0473,-25.6632,2.8443},
	{31.9013,-56.3035,1.9272},
	{46.7019,-85.2065,0.3364},
	{45.9915,-105.2618,0.3439},
	{29.1215,-117.1285,0.3417},
	{1.1807,-114.1360,1.1453},
	{-32.7674,-107.6829,2.8443},
	{-29.6265,-81.2801,2.8443},
	{-20.4721,-53.6303,2.8443},
	{-13.8598,-33.6587,2.8443},
	{8.2521,-41.7090,2.8443},
	{31.1525,-71.0397,1.1335},
	{37.4018,-98.8097,0.3439},
	{1.5713,-100.6653,1.9498},
	{-30.1963,-93.6633,2.8443},
	{-15.7309,-60.2485,2.8443},
	{13.4492,-68.8684,2.5976},
	{17.8934,-88.1368,1.4140},
	{-5.8526,-88.5889,2.8175},
	{-13.0663,-7.7515,2.8443},
	{-18.9069,-34.4990,2.8443},
	{-35.8022,-88.0728,2.8443},
	{-24.8965,-77.6471,2.8443},
	{-4.7946,-17.1011,2.8443},
	{-8.5043,-56.5747,2.8443},
	{-23.3348,-107.0294,2.8443},
	{-8.2773,-84.1133,2.8443},
	{9.7677,-30.1203,2.8443},
	{7.9415,-66.0706,2.8443},
	{-5.0080,-113.0405,1.6866},
	{13.4023,-76.9250,2.1330},
	{22.1222,-47.8341,2.8443},
	{24.4490,-76.3321,1.3614},
	{14.2450,-114.9567,0.3368},
	{30.8839,-94.8228,0.3502},
	{37.2782,-73.4482,0.6027},
	{48.4938,-87.3035,0.3364},
	{43.1379,-111.3998,0.3439},
	{35.3125,-98.7780,0.3439},
	{38.7870,-71.6889,0.5629},
	{24.8994,-89.4044,0.9184},
	{16.4566,-110.4283,0.3529},
	{16.5062,-81.5700,1.7035},
	{24.2285,-45.9708,2.8443},
	{7.7389,-70.9911,2.8241},
	{-4.6728,-113.8621,1.6048},
	{-6.3559,-85.5800,2.8444},
	{9.9812,-29.4406,2.8443},
	{-13.8897,-61.1822,2.8443},
	{-28.4458,-104.5879,2.8443},
	{-42.4603,-106.3412,2.8443}
};

new Float:Tractor_4[][3] = {
	{-46.0360,-92.0328,2.8443},
	{12.9325,38.8396,2.8443},
	{19.0635,54.1178,2.8443},
	{35.9757,54.6685,2.7526},
	{54.4293,41.7030,0.8443},
	{74.7920,25.4737,0.3365},
	{76.0909,-2.7735,0.3365},
	{70.9725,-35.2925,0.3365},
	{61.8716,-28.1147,0.8260},
	{46.6940,-9.8157,2.3704},
	{23.7543,18.8023,2.8443},
	{23.9922,33.9984,2.8443},
	{53.2735,26.5603,1.1420},
	{68.6421,12.5850,0.3605},
	{64.6578,-7.5840,1.0735},
	{40.1216,12.2215,2.6909},
	{31.1644,27.3824,2.8443},
	{19.8489,60.8907,2.8443},
	{23.8581,49.5620,2.8443},
	{18.4074,30.5573,2.8443},
	{28.9277,33.9416,2.8443},
	{37.2905,29.7881,2.8092},
	{31.5283,7.8278,2.8443},
	{43.7324,15.9246,2.2629},
	{53.9587,39.3569,0.9166},
	{52.7938,20.9055,1.2776},
	{44.4139,-4.3250,2.4703},
	{53.4886,-2.4603,1.7673},
	{65.9020,27.6340,0.3367},
	{67.4286,11.7024,0.4369},
	{58.1326,-16.6441,1.4546},
	{67.1868,-18.4737,0.8430},
	{77.5707,11.4331,0.3365},
	{60.6334,5.6678,1.0598},
	{53.4010,-11.3925,1.9022},
	{50.7757,4.1504,1.8117},
	{61.6892,34.0681,0.3684},
	{49.2945,23.4171,1.5733},
	{40.3763,-0.7716,2.7486},
	{39.3209,25.1209,2.6793},
	{46.2001,44.1089,1.7548},
	{33.5187,41.8569,2.8442},
	{24.1115,20.2631,2.8443},
	{22.9938,40.0757,2.8443},
	{29.5534,58.6050,2.8443},
	{17.3089,50.1506,2.8443},
	{12.4576,37.2420,2.8443}
};

//
new FarmData[MAX_PLAYERS][2];
new OnOneLevelJob[MAX_PLAYERS];
new OnLevelKol[MAX_PLAYERS];
new InPlayerPoint[MAX_PLAYERS];
new Skill[MAX_PLAYERS];
new Level[MAX_PLAYERS];
new SelectFarmJob[MAX_PLAYERS];
new KolhozJobPickup[3];
new KolhozPickup[6];
new JobTraktor[MAX_PLAYERS];
new JobCombine[MAX_PLAYERS];
new JobFly[MAX_PLAYERS];
new TraktorVeh[2];
new FlyVeh[2];
new CombineVeh[2];
new KolInfo[][150] = {
	{"Приветствуем Вас в нашем Колхозе! Здесь вы сможете временно подзаработать деньжат"},
	{"или остаться навсегда и зарабатывать хорошие деньги. Вы начинаете свою карьеру фермера"},
	{"с простого звания \"помощник\". Ваша цель заключается в помощи основным фермерам, то есть"},
	{"перенести воду и тому подобное. Если вы уже достаточно хороши, то Вас переведут на"},
	{"новую должность \"Тракторист\" где вы будите заниматься обработкой полей."},
	{"Следующее звание после тракториста это \"Комбайнёр\" суть заключается в сборе урожая с полей."},
	{"Ну, а уже вершина фермерства, это конечно же лётчик! Ваша задача будет заключаться в распыление"},
	{"удобрений над полями. Хочу сразу Вам сообщить чем выше ваша специальность, тем и выше ваша зарплата!"},
	{"Узнать свой навык фермера вы можете с помощью команды /fskill.\n"},
	{"Удачной Вам работы в нашем колхозе!"}
};
new PlayerInKolhoz[MAX_PLAYERS];
new Text3D:Kolhoz;
// Ферма №2
new StartGarden[MAX_PLAYERS];
new AmmountWood[MAX_PLAYERS];
new gTreeSad[30];
new Float:TreeSad[][30] = {
	{-1049.0080566,-1584.0729980,76.3672},
	{-1049.0080566,-1591.5649414,76.3672},
	{-1049.0080566,-1598.2889404,76.3672},
	{-1055.2600098,-1584.0729980,76.3672},
	{-1055.2600098,-1591.5649414,76.3672},
	{-1055.2597656,-1598.2880859,76.3672},
	{-1061.2580566,-1584.0729980,76.3672},
	{-1061.2580566,-1591.5649414,76.3672},
	{-1061.2580566,-1598.2889404,76.3672},
	{-1067.7080078,-1598.2889404,76.3672},
	{-1067.7080078,-1591.5649414,76.3672},
	{-1067.7080078,-1584.0729980,76.3672},
	{-1073.9350586,-1584.0729980,76.3672},
	{-1079.3060303,-1584.0729980,76.3672},
	{-1084.3489990,-1584.0729980,76.3672},
	{-1089.2010498,-1584.0729980,76.3672},
	{-1094.2049561,-1584.0729980,76.3672},
	{-1099.7939453,-1584.0729980,76.3672},
	{-1099.7939453,-1591.5649414,76.3672},
	{-1073.9350586,-1591.5649414,76.3672},
	{-1079.3060303,-1591.5649414,76.3672},
	{-1084.3489990,-1591.5649414,76.3672},
	{-1089.2010498,-1591.5649414,76.3672},
	{-1094.2049561,-1591.5649414,76.3672},
	{-1073.9350586,-1597.9060059,76.3672},
	{-1079.3060303,-1597.9060059,76.3672},
	{-1084.3489990,-1597.9060059,76.3672},
	{-1089.2010498,-1597.9060059,76.3672},
	{-1094.2049561,-1597.9060059,76.3672},
	{-1099.7939453,-1597.9060059,76.3672}
};
// vars textdraws
new
	PlayerText:ShieldBar[MAX_PLAYERS],
	PlayerText:FishTD[10][MAX_PLAYERS],
	PlayerText:PTD_crubjob[MAX_PLAYERS][16],
	PlayerText:PTD_midii[MAX_PLAYERS],
	PlayerText:PTD_oxygen[MAX_PLAYERS],
	PlayerText:RegDraws[16][MAX_PLAYERS],
	PlayerText:SpeedDraw[7][MAX_PLAYERS],
	PlayerText:AutoSalonTD[10][MAX_PLAYERS],
	PlayerText:TuningTD[11][MAX_PLAYERS],
	PlayerText:CasinoDraw[15][MAX_PLAYERS],
	PlayerText:inv_OtherPTD[MAX_PLAYERS][6],
	PlayerText:inv_SlotsPTD[MAX_PLAYERS][21],
	PlayerText:SpecTD[16][MAX_PLAYERS],
	PlayerBar:HungerBar[MAX_PLAYERS],
	PlayerText:InvTD[4][MAX_PLAYERS]
;
new
	Text:GardenDraw[MAX_PLAYERS],
	Text:SkinCost[MAX_PLAYERS],
	Text:g_Capture[6][MAX_PLAYERS],
	Text:AnimDraw[MAX_PLAYERS],
	Text:FishDraw[MAX_PLAYERS],
	Text:ProcentDraw[MAX_PLAYERS],
	Text:AmountLDraw[MAX_PLAYERS],
	Text:AmountDraw[MAX_PLAYERS],
	Text:MinerDraw[MAX_PLAYERS],
	Text:inv_BoxTD[22],
	Text:ShieldBG[2],
	Text:HungerText,
	Text:Digit1[6],
	Text:Digit2[6],
	Text:Digit3[6],
	Text:FULLBOX,
	Text:URL[5]
;
// fish
new MenuFish[MAX_PLAYERS];
new Fishjob[MAX_PLAYERS];
new FishMojno[MAX_PLAYERS];
new FishJobPick[MAX_PLAYERS];
new PlayerFish[MAX_PLAYERS];
new FishStart[MAX_PLAYERS];
new FishBegin[MAX_PLAYERS];
//
new Tazer[MAX_PLAYERS];
new Spark[MAX_PLAYERS];
new Tazed[MAX_PLAYERS];
// Скины
new TOTALGRUZ;
new ShahtaPick,GruzPick[1],LessPick[2];
new Help,BelayPick,ClotPick[1];
new BuyCarPick[1],BankPick,GaragePick;
new coordh[90],coordexx[90], boordh[456], coordexxb[90], coordc[90];
new TOTALGZ, TOTALHOUSE, TOTALCARS, TOTALBIZZ, TOTALPARK, TOTALCARSPARK, TOTALENTERS, TOTALADVERT[1], TOTALPRODUCT, TOTALFUEL;
new SpeedString[56];
new ghour;
new FuelBank;
//
new qurey[512], strin[2048], query[1048];
new cWorkSalary[MAX_PLAYERS];
new ambucile[2],liccar[7],schoolcar[2],mercar[2],fbicar[2],fishcar[2],mechanics[10],sancar[2];
new cHandle, noooc = 1;
new AntiDM[MAX_PLAYERS];
//
new JoinRegF[7][1] = { // Мужской
	{239},
	{200},
	{136},
	{212},
	{135},
	{134},
	{79}
};
new JoinRegM[3][1] = { // Женский
	{40},
	{55},
	{69}
};
new JoinShopF[32][2] = { // Мужской
	{3, 1000},
	{4, 2000},
	{5, 2500},
	{6, 3000},
	{7, 3500},
	{18, 4000},
	{19, 4500},
	{20, 5000},
	{21, 5500},
	{22, 6000},
	{23, 6500},
	{24, 7000},
	{28, 7500},
	{29, 8000},
	{30, 8500},
	{33, 9000},
	{45, 9500},
	{220, 10000},
	{47, 11000},
	{48, 12000},
	{97, 13000},
	{101, 14000},
	{142, 15000},
	{144, 16000},
	{146, 17000},
	{154, 18000},
	{180, 19000},
	{184, 20000},
	{185, 22000},
	{202, 23000},
	{206, 24000},
	{46, 24000}
};
new JoinShopM[9][2] = { // Женский
	{12, 1000},
	{13, 2000},
	{91, 3000},
	{169, 4000},
	{192, 5000},
	{216, 6000},
	{214, 7000},
	{224, 8000},
	{233, 10000}
};
//
#define MAX_GZONE 150
new ZoneTimer[MAX_GZONE];
new ZoneOnBattle[MAX_GZONE];
new GZSafeTime[MAX_GZONE];
enum GzoneInfo
{
	id,
Float:gCoords[4],
	gFrak,
	gNapad
}
new GZInfo[MAX_GZONE][GzoneInfo];
new FrakCD[20];
new GangCD[20];
//
#define MAXENTERS 100
enum eInfo
{
	id,
Float:pX,
Float:pY,
Float:pZ,
	pM,
	pT,
	pI,
	pV,
Float:ptX,
Float:ptY,
Float:ptZ,
Float:ptFa,
	ptI,
	ptV,
	pName[32],
	pP
};
new EntersInfo[MAXENTERS][eInfo];
//
#define MAX_LBIZZ 4
enum lbInfo
{
	lID,
	lName[20],
	lOwner[MAX_PLAYER_NAME],
	lWorker_1[MAX_PLAYER_NAME],
	lWorker_2[MAX_PLAYER_NAME],
	lWorker_3[MAX_PLAYER_NAME],
	//	lPIn,
	lStartCP[2],
	//	Text3D:lText,
	lObject,
	lMaterials[2],
	lPrice,
	lCost,
	lCars[2],
	lPickWork[4]
};
new LBizz[MAX_LBIZZ][lbInfo];
new TOTALLBIZZ;
//
#define MAXHOUSE 400
enum hInfo
{
	id,
Float:hEntrx,
Float:hEntry,
Float:hEntrz,
Float:hExitx,
Float:hExity,
Float:hExitz,
Float:hEx,
Float:hEy,
Float:hEz,
Float:hEp,
Float:hCarx,
Float:hCary,
Float:hCarz,
Float:hCarfa,
	hOwner[32],
	hPrice,
	hBuyPrice,
	hInt,
	hType,
	hVirtual,
	hLock,
	hMIcon,
	hPickup,
	hOplata,
	hDiscript[16],
	// Улучшения //
	hOutput, // Авто Выход
	hGrant, // Субсидия
	hMedicine, // Аптечка
	hSafe, // Сейф
	hLocker, // Шкаф
	// Пикапы улучшений
	hMedPickup
};
new HouseInfo[MAXHOUSE][hInfo];
//
#define MAX_MYCARS 500
enum cInfo
{
	id,
Text3D: cText,
	cOwner[MAX_PLAYER_NAME],
	cModel,
	cFuel,
	cColors[16],
	cColor[2],
	cLock,
Float:cX,
Float:cY,
Float:cZ,
Float:cFa,
	cID
};
new CarInfo[MAX_MYCARS][cInfo];
//

//
#define MAX_BIZZ 50
enum bzInfo
{
	id,
Float:bEntrx,
Float:bEntry,
Float:bEntrz,
Float:bExitx,
Float:bExity,
Float:bExitz,
Float:bMenux,
Float:bMenuy,
Float:bMenuz,
	bOwner[MAX_PLAYER_NAME],
	bPrice,
	bBuyPrice,
	bMoney,
	bBank,
	bType,
	bLic,
	bInt,
	bVirtual,
	bLock,
	bEnter,
	bMIcon,
Float:bINx,
Float:bINy,
Float:bINz,
Float:bINp,
Float:bEx,
Float:bEy,
Float:bEz,
Float:bEp,
	bIcon,
	bPickup,
	bPickupExit,
	bName[MAX_PLAYER_NAME],
	bProduct,
	bTill,
	bMenu,
	bLockTime,
	bMafia[24],
	bWar,
	bAttackMafia,
bool:bRobBiz,
bool:bRob,
};
new Text3D:LABELBIZZ[MAX_BIZZ];
new BizzInfo[MAX_BIZZ][bzInfo];
new BizzPay[MAX_BIZZ];
//
#define MAX_PARK 3
enum bpInfo
{
	tID,
	tName[32],
	tOwner[MAX_PLAYER_NAME],
	tBank,
	tTarif,
	tCost,
Float:tX,
Float:tY,
Float:tZ,
};
new Text3D:LABELPARK[MAX_PARK];
new BizzPark[MAX_PARK][bpInfo];
//
enum AC_STRUCT_INFO
{
Float:LastOnFootPosition[3],
	checkmaptp,
	maptplastclick,
Float:maptp[3]
}
new acstruct[MAX_PLAYERS][AC_STRUCT_INFO];
//
//
new Float:ATMInfo[8][12] = {
	{1463.9300537,-1750.3439941,15.2469997,0.0000000,0.0000000,270.0000000},
	{1112.3719482,-1805.6049805,16.4559994,0.0000000,0.0000000,0.0000000},
	{2308.8569336,-1639.1090088,14.7290001,0.0000000,0.0000000,0.0000000},
	{1928.6910400,-1779.9530029,13.4490004,0.0000000,0.0000000,180.0000000},
	{1367.1510010,-1289.9429932,13.4490004,0.0000000,0.0000000,0.0000000},
	{501.9939880,-1364.9210205,16.0349998,0.0000000,0.0000000,198.0000000},
	{1144.1970215,-1765.9429932,13.5100002,0.0000000,0.0000000,270.0000000},
	{1833.3360596,-1846.2230225,13.4799995,0.0000000,0.0000000,0.0000000}
};
//
new HelpNoob[][] = {
	{"Добро пожаловать на "NameServer"\n\n"},
	{"Первым делом необходимо заработать деньги.\n"},
	{"В государстве есть предприятия,куда Вы сможете устроиться на первое время.\n"},
	{"Это шахта,лесопилка и грузчики.\n"},
	{"Работая там, Вы не только получите прибыль,но и найдёте новых друзей.\n\n"},
	{"Все эти места можно найти, используя команду /gps.\n"},
	{"Добраться до нужного объекта Вам поможет либо такси, либо автобусы.\n"},
	{"После того,как Вы заработаете денег,отправляйтесь\n"},
	{"в автошколу и сдавайте экзамен на права.\nПриятной игры.\n\n"},
	{"Играя на сервере,Вы зарабатываете очки опыта.\n"},
	{"При накопление их определённого количества происходит переход на следующий уровень.\n"},
	{"С каждым новым уровнем открываются новые возможности.\n"},
	{"Для просмотра статистики воспользуйтесь командой /mn."}
};
//
new HelpMoyor[][] = {
	{"Установка ЗП гос.Фракциям: /salary\n"},
	{"ID Фракций: 1 - Мэрия, 2 - SAPD, 3 - СМИ, 4 - ВМФ, 5 - Больница LS,\n"},
	{"ID Фракций: 11 - FBI,12 - Автошкола,13 - Сухопутные Войска\n\n"},
	{"Уволить сотрудника гос.Фракции /muninvite\n"},
	{"Уволить можно только с таких фракций как: Мэрия, SAPD, Больница, Армия."}
};
//
new HelpLes[][] = {
	{"Добро пожаловать на лесопилку.\n\n"},
	{"{ffffff}Здесь Вы сможете заработать немного денег, вы пилите лес и приносите\n"},
	{"его на склад за каждый принесенный кг вы получаете 2$\n"},
	{"с одного дерева может быть от 30 до 80 кг.\n\n"},
	{"Что бы начать работу встаньте на пикап одежды, далее у Вас на мини карте\n"},
	{"отобразится дерево которое нужно спилить, следуете к нему, далее\n"},
	{"встаньте на чекпоинт и начинаете нажимать ЛКМ не удерживая.\n"}
};
new gDerevo[38], DerevoP[38], TOTALDEREVO;
new Float:Derevo[][3] = {
	{-750.2000122,-157.5370026,66.0350037},
	{-711.8060303,-179.0319977,64.4960022},
	{-679.9680176,-179.4949951,61.8339996},
	{-657.0419922,-112.7610016,61.7270012},
	{-670.2169800,-174.7209930,60.4840012},
	{-645.4423828,-132.9521484,61.6320000},
	{-703.9873047,-108.1845703,66.3079987},
	{-671.0664062,-88.2119141,63.2220001},
	{-659.8007812,-89.8779297,62.2849998},
	{-643.1074219,-147.9228516,63.2989998},
	{-654.3154297,-141.6699219,60.5400009},
	{-663.8720703,-127.9794922,59.9269981},
	{-662.0986328,-148.3554688,59.6180000},
	{-673.1420288,-136.9120026,58.8279991},
	{-723.8759766,-195.5390015,66.3769989},
	{-680.4453125,-148.3261719,59.9189987},
	{-683.3857422,-122.3339844,61.4650002},
	{-688.1484375,-105.6562500,64.1429977},
	{-699.9248047,-129.1474609,65.5139999},
	{-693.5517578,-136.9414062,63.5660019},
	{-713.2568359,-197.9736328,67.3720016},
	{-702.5097656,-190.0068359,65.1600037},
	{-690.4238281,-200.7275391,66.5159988},
	{-690.5312500,-183.6718750,63.4370003},
	{-697.0185547,-177.0214844,62.6329994},
	{-711.5498047,-188.4101562,65.8720016},
	{-740.0239868,-164.3639984,66.3140030},
	{-722.2451172,-184.1347656,65.6930008},
	{-730.7431641,-191.5781250,65.4729996},
	{-727.8164062,-184.1787109,65.3850021},
	{-731.6396484,-159.5820312,65.7979965},
	{-760.5097656,-152.9121094,65.0260010},
	{-755.0498047,-168.6611328,66.5350037},
	{-733.9730225,-143.4779968,65.9619980},
	{-728.1699219,-131.7451172,66.8369980},
	{-708.1710205,-122.8440018,67.9089966},
	{-714.6279907,-147.3619995,66.0390015},
	{-649.9329834,-107.3590012,61.7220001}
};
//
new Float:LicTest[][6] = {
	{1268.7330,-1336.6506,13.0776, 1260.6998,-1310.0940,12.8383},
	{1260.6998,-1310.0940,12.8383, 1265.9556,-1283.7482,13.0196},
	{1265.9556,-1283.7482,13.0196, 1335.9600,-1283.0841,13.1256},
	{1335.9600,-1283.0841,13.1256, 1357.8342,-1271.5781,13.1198},
	{1357.8342,-1271.5781,13.1198, 1359.9823,-1208.3970,16.9359},
	{1359.9823,-1208.3970,16.9359, 1364.5671,-1095.7656,23.7967},
	{1364.5671,-1095.7656,23.7967, 1373.0815,-997.7939,28.1747},
	{1373.0815,-997.7939,28.1747, 1379.2795,-948.3279,33.9321},
	{1379.2795,-948.3279,33.9321, 1322.1812,-922.4108,37.0894},
	{1322.1812,-922.4108,37.0894, 1234.2091,-928.5974,42.2444},
	{1234.2091,-928.5974,42.2444, 1061.6532,-949.5337,42.4987},
	{1061.6532,-949.5337,42.4987, 914.6758,-970.7729,37.8150},
	{914.6758,-970.7729,37.8150, 815.8525,-1038.3102,24.7163},
	{815.8525,-1038.3102,24.7163, 721.5104,-1078.6427,21.1269},
	{721.5104,-1078.6427,21.1269, 649.5274,-1190.5507,17.7645},
	{649.5274,-1190.5507,17.7645, 503.0898,-1268.7815,15.5010},
	{503.0898,-1268.7815,15.5010, 269.8210,-1412.5554,13.3516},
	{269.8210,-1412.5554,13.3516, 172.3436,-1514.8584,12.0031},
	{172.3436,-1514.8584,12.0031, 143.1541,-1560.5740,10.0753},
	{143.1541,-1560.5740,10.0753, 189.5229,-1629.9485,14.1501},
	{189.5229,-1629.9485,14.1501, 277.0486,-1704.7428,7.3496},
	{277.0486,-1704.7428,7.3496, 482.3740,-1727.1942,10.7659},
	{482.3740,-1727.1942,10.7659, 693.4329,-1764.8268,13.1975},
	{693.4329,-1764.8268,13.1975, 874.2587,-1788.0198,13.3720},
	{874.2587,-1788.0198,13.3720, 1021.2010,-1816.3195,13.6494},
	{1021.2010,-1816.3195,13.6494, 1044.6315,-1870.8881,13.0146},
	{1044.6315,-1870.8881,13.0146, 1033.6710,-2059.1570,12.7030},
	{1033.6710,-2059.1570,12.7030, 1073.8364,-2341.8689,12.1971},
	{1073.8364,-2341.8689,12.1971, 1354.9703,-2465.4207,7.4009},
	{1354.9703,-2465.4207,7.4009, 1360.1809,-2406.3813,12.7452},
	{1360.1809,-2406.3813,12.7452, 1349.3368,-2365.5669,13.1183},
	{1349.3368,-2365.5669,13.1183, 1350.8160,-2216.5557,13.1259},
	{1350.8160,-2216.5557,13.1259, 1419.0465,-2138.4956,13.1238},
	{1419.0465,-2138.4956,13.1238, 1549.3959,-2128.9834,14.6308},
	{1549.3959,-2128.9834,14.6308, 1654.4175,-2049.1184,21.5312},
	{1654.4175,-2049.1184,21.5312, 1646.5652,-1874.7632,24.8648},
	{1646.5652,-1874.7632,24.8648, 1617.8961,-1627.7577,28.2850},
	{1617.8961,-1627.7577,28.2850, 1733.1375,-1527.3917,17.7543},
	{1733.1375,-1527.3917,17.7543, 1920.2747,-1519.2937,2.9996},
	{1920.2747,-1519.2937,2.9996, 2023.4193,-1538.8391,3.7861},
	{2023.4193,-1538.8391,3.7861, 2037.0146,-1605.9697,13.1229},
	{2037.0146,-1605.9697,13.1229, 2002.5277,-1614.0889,13.1257},
	{2002.5277,-1614.0889,13.1257, 1999.3680,-1698.6743,13.1237},
	{1999.3680,-1698.6743,13.1237, 1997.8173,-1746.2483,13.1263},
	{1997.8173,-1746.2483,13.1263, 1910.2736,-1750.0333,13.1238},
	{1910.2736,-1750.0333,13.1238, 1828.1191,-1748.6030,13.1256},
	{1828.1191,-1748.6030,13.1256, 1824.1262,-1667.5099,13.1239},
	{1824.1262,-1667.5099,13.1239, 1822.1460,-1613.9178,13.1259},
	{1822.1460,-1613.9178,13.1259, 1742.8854,-1596.8115,13.1218},
	{1742.8854,-1596.8115,13.1218, 1585.0579,-1590.4355,13.1250},
	{1585.0579,-1590.4355,13.1250, 1391.1044,-1586.7186,13.1003},
	{1391.1044,-1586.7186,13.1003, 1318.2684,-1568.1918,13.1224},
	{1318.2684,-1568.1918,13.1224, 1341.0079,-1498.0977,13.1317},
	{1341.0079,-1498.0977,13.1317, 1356.5416,-1409.5077,13.0814},
	{1356.5416,-1409.5077,13.0814, 1330.6112,-1394.4271,13.1088},
	{1330.6112,-1394.4271,13.1088, 1266.9966,-1392.6808,12.9019},
	{1266.9966,-1392.6808,12.9019, 1261.1516,-1362.2327,12.9387},
	{1261.1516,-1362.2327,12.9387, 1275.8715,-1336.7813,13.0985},
	{1275.8715,-1336.7813,13.0985, 0.0, 0.0, 0.0}
};
new Float:LS_001[][] = {
	{1201.4569,-1849.6388,13.1176, 1105.3660,-1849.8339,13.1099},
	{1105.3660,-1849.8339,13.1099, 1067.6992,-1848.5333,13.1251},
	{1067.6992,-1848.5333,13.1251, 996.0375,-1786.3171,13.7866},
	{996.0375,-1786.3171,13.7866, 852.4565,-1767.3273,13.1109},
	{852.4565,-1767.3273,13.1109, 597.2985,-1722.0939,13.4006},
	{597.2985,-1722.0939,13.4006, 261.9023,-1675.8788,8.7522},
	{261.9023,-1675.8788,8.7522, 80.6155,-1526.3883,4.8406},
	{80.6155,-1526.3883,4.8406, -119.4850,-1467.0231,2.4224},
	{-119.4850,-1467.0231,2.4224, -138.3743,-1258.0963,2.4224},
	{-138.3743,-1258.0963,2.4224, -110.6903,-1168.2607,2.4229},
	{-110.6903,-1168.2607,2.4229, -98.1648,-1016.3236,23.8608},
	{-98.1648,-1016.3236,23.8608, -311.7650,-864.9837,46.5850},
	{-311.7650,-864.9837,46.5850, -422.8170,-827.6479,48.2917},
	{-422.8170,-827.6479,48.2917, -660.8547,-999.0225,69.2810},
	{-660.8547,-999.0225,69.2810, -883.9902,-1107.8635,98.4819},
	{-883.9902,-1107.8635,98.4819, -980.8583,-1021.8743,95.0874},
	{-980.8583,-1021.8743,95.0874, -1214.1316,-782.1636,63.8335},
	{-1214.1316,-782.1636,63.8335, -1186.7393,-712.4459,54.8481},
	{-1186.7393,-712.4459,54.8481, -1072.2092,-472.4487,33.8894},
	{-1072.2092,-472.4487,33.8894, -958.6791,-312.5332,35.9849},
	{-958.6791,-312.5332,35.9849, -907.7277,-147.0709,54.5648},
	{-907.7277,-147.0709,54.5648, -824.1331,-121.7405,62.5065},
	{-824.1331,-121.7405,62.5065, -672.1729,-20.5505,70.6895},
	{-672.1729,-20.5505,70.6895, -768.8759,-15.7635,49.1476},
	{-768.8759,-15.7635,49.1476, -882.9476,-45.0397,35.3601},
	{-882.9476,-45.0397,35.3601, -770.5917,18.9089,33.0889},
	{-770.5917,18.9089,33.0889, -665.5009,64.4130,29.4829},
	{-665.5009,64.4130,29.4829, -754.5657,114.8755,13.6453},
	{-754.5657,114.8755,13.6453, -632.6235,267.6552,1.8093},
	{-632.6235,267.6552,1.8093, -283.0392,256.3867,5.5248},
	{-283.0392,256.3867,5.5248, -208.9173,231.0797,11.7957},
	{-208.9173,231.0797,11.7957, -263.4819,98.3509,0.8051},
	{-263.4819,98.3509,0.8051, -270.0930,-239.4473,0.9621},
	{-270.0930,-239.4473,0.9621, -163.9831,-366.6205,0.8052},
	{-163.9831,-366.6205,0.8052, 14.1655,-497.2800,7.4222},
	{14.1655,-497.2800,7.4222, 34.3248,-646.6037,2.8280},
	{34.3248,-646.6037,2.8280, 186.0854,-671.7206,13.0794},
	{186.0854,-671.7206,13.0794, 277.4281,-568.1735,40.2241},
	{277.4281,-568.1735,40.2241, 545.7624,-630.4413,27.8758},
	{545.7624,-630.4413,27.8758, 676.9816,-666.7595,15.9075},
	{676.9816,-666.7595,15.9075, 698.5291,-854.8687,42.9339},
	{698.5291,-854.8687,42.9339, 793.7012,-971.6129,36.5113},
	{793.7012,-971.6129,36.5113, 794.5907,-1092.1525,23.6980},
	{794.5907,-1092.1525,23.6980, 795.3058,-1280.6267,13.1099},
	{795.3058,-1280.6267,13.1099, 794.3935,-1342.7048,13.1099},
	{794.3935,-1342.7048,13.1099, 801.5806,-1401.9917,13.1458},
	{801.5806,-1401.9917,13.1458, 915.9931,-1406.1180,12.9694},
	{915.9931,-1406.1180,12.9694, 1094.1436,-1406.4486,13.1957},
	{1094.1436,-1406.4486,13.1957, 1335.9872,-1407.0449,13.0819},
	{1335.9872,-1407.0449,13.0819, 1309.2656,-1516.7764,13.1115},
	{1309.2656,-1516.7764,13.1115, 1296.0658,-1690.1221,13.1099},
	{1296.0658,-1690.1221,13.1099, 1295.9518,-1793.9869,13.1099},
	{1295.9518,-1793.9869,13.1099, 1293.5168,-1847.7988,13.1098},
	{1293.5168,-1847.7988,13.1098, 0.0, 0.0, 0.0}
};
new Float:LS_002[][] = {
	{1199.4203,-1850.1726,13.1197, 1105.5020,-1849.8268,13.1099},
	{1105.5020,-1849.8268,13.1099, 1066.5950,-1848.3524,13.1255},
	{1066.5950,-1848.3524,13.1255, 1035.9941,-1799.5089,13.4116},
	{1035.9941,-1799.5089,13.4116, 1040.1788,-1735.3932,13.1099},
	{1040.1788,-1735.3932,13.1099, 1039.9426,-1672.7139,13.1099},
	{1039.9426,-1672.7139,13.1099, 1042.8649,-1539.0129,13.0885},
	{1042.8649,-1539.0129,13.0885, 1066.1495,-1411.1494,13.1704},
	{1066.1495,-1411.1494,13.1704, 1174.3818,-1405.2864,13.0284},
	{1174.3818,-1405.2864,13.0284, 1226.5746,-1406.4996,12.8375},
	{1226.5746,-1406.4996,12.8375, 1340.2357,-1403.9581,13.0468},
	{1340.2357,-1403.9581,13.0468, 1360.3699,-1263.7716,13.1100},
	{1360.3699,-1263.7716,13.1100, 1364.5546,-1094.7816,23.8241},
	{1364.5546,-1094.7816,23.8241, 1380.2964,-953.0461,33.9160},
	{1380.2964,-953.0461,33.9160, 1466.4319,-967.7833,35.9636},
	{1466.4319,-967.7833,35.9636, 1575.9694,-993.5736,46.2056},
	{1575.9694,-993.5736,46.2056, 1709.0037,-893.9179,54.4946},
	{1709.0037,-893.9179,54.4946, 1707.2539,-746.8818,50.9925},
	{1707.2539,-746.8818,50.9925, 1700.7183,-436.3828,33.6106},
	{1700.7183,-436.3828,33.6106, 1677.8285,-194.6512,39.8415},
	{1677.8285,-194.6512,39.8415, 1636.0099,8.7223,36.3923},
	{1636.0099,8.7223,36.3923, 1645.0591,214.4654,30.7281},
	{1645.0591,214.4654,30.7281, 1717.2603,434.0779,30.7878},
	{1717.2603,434.0779,30.7878, 1800.0808,719.9825,13.8682},
	{1800.0808,719.9825,13.8682, 1802.3809,838.0095,10.3985},
	{1802.3809,838.0095,10.3985, 1637.6589,855.8576,6.4604},
	{1637.6589,855.8576,6.4604, 1523.3146,856.3566,6.5396},
	{1523.3146,856.3566,6.5396, 1405.1072,874.2686,6.6081},
	{1405.1072,874.2686,6.6081, 1248.8505,931.3582,13.5001},
	{1248.8505,931.3582,13.5001, 973.3191,758.6473,10.4288},
	{973.3191,758.6473,10.4288, 884.7071,730.0840,10.5686},
	{884.7071,730.0840,10.5686, 691.9041,678.5031,8.8300},
	{691.9041,678.5031,8.8300, 460.3644,747.0787,4.6210},
	{460.3644,747.0787,4.6210, 308.2527,827.0485,15.0312},
	{308.2527,827.0485,15.0312, 240.0421,946.0137,27.2877},
	{240.0421,946.0137,27.2877, 156.2506,1161.6443,14.5137},
	{156.2506,1161.6443,14.5137, 71.2352,1242.6957,17.8347},
	{71.2352,1242.6957,17.8347, -81.3508,1263.3907,12.6908},
	{-81.3508,1263.3907,12.6908, -117.8920,1255.1191,17.5049},
	{-117.8920,1255.1191,17.5049, -116.9781,1205.8013,19.3204},
	{-116.9781,1205.8013,19.3204, -49.8087,1196.2346,18.9408},
	{-49.8087,1196.2346,18.9408, 69.2712,1195.7616,18.3356},
	{69.2712,1195.7616,18.3356, 114.8787,1193.7725,17.5418},
	{114.8787,1193.7725,17.5418, 178.7425,1139.9785,13.9722},
	{178.7425,1139.9785,13.9722, 190.9562,1065.6177,19.5112},
	{190.9562,1065.6177,19.5112, 219.7291,971.9219,27.9770},
	{219.7291,971.9219,27.9770, 142.2764,895.0600,20.4028},
	{142.2764,895.0600,20.4028, -72.1407,851.1045,17.7673},
	{-72.1407,851.1045,17.7673, -120.4081,822.0826,20.2102},
	{-120.4081,822.0826,20.2102, -122.0569,760.9843,20.3310},
	{-122.0569,760.9843,20.3310,-257.7567,700.1398,22.1797},
	{-257.7567,700.1398,22.1797, -298.6697,645.6609,16.6035},
	{-298.6697,645.6609,16.6035, -175.3973,648.3017,4.5177},
	{-175.3973,648.3017,4.5177, -133.2605,582.1564,2.1483},
	{-133.2605,582.1564,2.1483, -123.2129,538.8138,6.8973},
	{-123.2129,538.8138,6.8973, -5.7284,597.4141,9.8859},
	{-5.7284,597.4141,9.8859, 301.3117,751.0546,5.8574},
	{301.3117,751.0546,5.8574, 561.8482,669.0468,3.3085},
	{561.8482,669.0468,3.3085, 752.0457,658.3029,10.6573},
	{752.0457,658.3029,10.6573, 895.7384,704.6238,10.5522},
	{895.7384,704.6238,10.5522, 1101.8900,800.2245,10.4343},
	{1101.8900,800.2245,10.4343, 1433.2969,830.8608,6.5396},
	{1433.2969,830.8608,6.5396, 1740.5981,832.0078,9.1937},
	{1740.5981,832.0078,9.1937, 1779.1925,828.1061,10.3978},
	{1779.1925,828.1061,10.3978, 1779.6833,730.0422,13.4795},
	{1779.6833,730.0422,13.4795, 1685.0817,404.4844,30.2121},
	{1685.0817,404.4844,30.2121, 1604.9296,116.8396,36.9145},
	{1604.9296,116.8396,36.9145, 1640.4280,-45.9609,36.2779},
	{1640.4280,-45.9609,36.2779, 1658.1078,-299.5047,40.1104},
	{1658.1078,-299.5047,40.1104, 1702.8650,-597.8558,37.9670},
	{1702.8650,-597.8558,37.9670, 1660.7195,-805.7227,56.4674},
	{1660.7195,-805.7227,56.4674, 1460.8289,-941.9529,35.7747},
	{1460.8289,-941.9529,35.7747, 1369.8312,-943.3286,33.9146},
	{1369.8312,-943.3286,33.9146, 1351.0150,-1042.3555,26.0152},
	{1351.0150,-1042.3555,26.0152, 1340.4735,-1160.0298,23.4115},
	{1340.4735,-1160.0298,23.4115, 1341.3901,-1312.6974,13.1394},
	{1341.3901,-1312.6974,13.1394, 1335.3678,-1461.5967,13.1099},
	{1335.3678,-1461.5967,13.1099, 1296.2599,-1614.2476,13.1099},
	{1296.2599,-1614.2476,13.1099, 1295.3075,-1772.5507,13.1099},
	{1295.3075,-1772.5507,13.1099, 1291.7075,-1848.3439,13.1099},
	{1291.7075,-1848.3439,13.1099, 0.0,0.0,0.0}
};
new Float:VLS_001[][] = {
	{1425.9856,-2290.2649,13.5164,1474.6715,-2335.1873,13.5160},
	{1474.6715,-2335.1873,13.5160,1522.1833,-2296.4788,13.5175},
	{1522.1833,-2296.4788,13.5175,1550.2677,-2288.5906,13.5159},
	{1550.2677,-2288.5906,13.5159,1573.5173,-2308.5667,13.5066},
	{1573.5173,-2308.5667,13.5066,1670.9579,-2321.9500,13.5162},
	{1670.9579,-2321.9500,13.5162,1735.2590,-2278.1284,13.5096},
	{1735.2590,-2278.1284,13.5096,1645.3805,-2250.9336,13.4578},
	{1645.3805,-2250.9336,13.4578,1602.9364,-2251.1384,13.4895},
	{1602.9364,-2251.1384,13.4895,1573.7974,-2275.1396,13.4896},
	{1573.7974,-2275.1396,13.4896,1538.1160,-2284.0410,13.5145},
	{1538.1160,-2284.0410,13.5145,1480.4966,-2238.4919,13.5162},
	{1480.4966,-2238.4919,13.5162,1426.1666,-2273.9956,13.5162},
	{1426.1666,-2273.9956,13.5162,1375.9984,-2283.1658,13.4847},
	{1375.9984,-2283.1658,13.4847,1394.9421,-2150.3794,13.5624},
	{1394.9421,-2150.3794,13.5624,1507.1821,-2134.1350,14.0077},
	{1507.1821,-2134.1350,14.0077,1648.9589,-1885.9653,25.1445},
	{1648.9589,-1885.9653,25.1445,1677.1862,-1552.5256,24.3077},
	{1677.1862,-1552.5256,24.3077,2004.8684,-1526.2664,3.5548},
	{2004.8684,-1526.2664,3.5548,2037.8474,-1602.1219,13.4582},
	{2037.8474,-1602.1219,13.4582,1999.5009,-1698.6061,13.5156},
	{1999.5009,-1698.6061,13.5156,1961.0165,-1748.8892,13.5166},
	{1961.0165,-1748.8892,13.5166,1837.3259,-1749.8286,13.5162},
	{1837.3259,-1749.8286,13.5162,1810.1166,-1730.0031,13.5283},
	{1796.9548,-1728.1865,13.5946,1647.5292,-1729.6987,13.5171},
	{1647.5292,-1729.6987,13.5171,1494.6831,-1728.3669,13.6017},
	{1494.6831,-1728.3669,13.6017,1440.8444,-1729.8751,13.5159},
	{1440.8444,-1729.8751,13.5159,1431.6813,-1633.5216,13.5159},
	{1431.6813,-1633.5216,13.5159,1442.7694,-1523.9670,13.5149},
	{1442.7694,-1523.9670,13.5149,1458.8400,-1361.3356,13.5910},
	{1458.8400,-1361.3356,13.5910,1457.3441,-1190.9618,21.0118},
	{1457.3441,-1190.9618,21.0118,1407.7413,-1148.2646,23.7904},
	{1407.7413,-1148.2646,23.7904,1340.2070,-1164.3558,23.8374},
	{1340.2070,-1164.3558,23.8374,1339.3868,-1272.5802,13.5157},
	{1339.3868,-1272.5802,13.5157,1192.1790,-1324.9620,13.5325},
	{1192.1790,-1324.9620,13.5325,1183.6560,-1393.0383,13.3774},
	{1183.6560,-1393.0383,13.3774,994.2583,-1393.3654,13.1215},
	{994.2583,-1393.3654,13.1215,47.8682,-1392.8207,13.6001},
	{647.8682,-1392.8207,13.6001,626.2689,-1216.3225,18.2374},
	{626.2689,-1216.3225,18.2374,533.2057,-1243.4243,16.6157},
	{533.2057,-1243.4243,16.6157,430.6579,-1322.8668,15.0284},
	{430.6579,-1322.8668,15.0284,282.7814,-1404.6782,13.8724},
	{282.7814,-1404.6782,13.8724,144.7735,-1572.9777,11.3227},
	{144.7735,-1572.9777,11.3227,225.2346,-1673.2980,11.3901},
	{225.2346,-1673.2980,11.3901,432.6401,-1720.8326,9.7572},
	{432.6401,-1720.8326,9.7572,689.8245,-1764.0013,13.5201},
	{689.8245,-1764.0013,13.5201,993.2617,-1806.3390,14.1864},
	{993.2617,-1806.3390,14.1864,1036.8676,-2042.3091,13.0898},
	{1036.8676,-2042.3091,13.0898,1068.5889,-2336.1128,12.7210},
	{1068.5889,-2336.1128,12.7210,1348.1245,-2467.1536,7.7900},
	{1348.1245,-2467.1536,7.7900,1349.3889,-2363.6921,13.5083},
	{1349.3889,-2363.6921,13.5083, 0.0,0.0,0.0}
};
//
enum SAZONE_MAIN {
	SAZONE_NAME[28],
Float:SAZONE_AREA[6]
};
new gSAZones[][SAZONE_MAIN] = {
	{"The Big Ear",                 {-410.00,1403.30,-3.00,-137.90,1681.20,200.00}},
	{"Aldea Malvada",               {-1372.10,2498.50,0.00,-1277.50,2615.30,200.00}},
	{"Angel Pine",                  {-2324.90,-2584.20,-6.10,-1964.20,-2212.10,200.00}},
	{"Arco del Oeste",              {-901.10,2221.80,0.00,-592.00,2571.90,200.00}},
	{"Avispa Country Club",         {-2646.40,-355.40,0.00,-2270.00,-222.50,200.00}},
	{"Avispa Country Club",         {-2831.80,-430.20,-6.10,-2646.40,-222.50,200.00}},
	{"Avispa Country Club",         {-2361.50,-417.10,0.00,-2270.00,-355.40,200.00}},
	{"Avispa Country Club",         {-2667.80,-302.10,-28.80,-2646.40,-262.30,71.10}},
	{"Avispa Country Club",         {-2470.00,-355.40,0.00,-2270.00,-318.40,46.10}},
	{"Avispa Country Club",         {-2550.00,-355.40,0.00,-2470.00,-318.40,39.70}},
	{"Back o Beyond",               {-1166.90,-2641.10,0.00,-321.70,-1856.00,200.00}},
	{"Battery Point",               {-2741.00,1268.40,-4.50,-2533.00,1490.40,200.00}},
	{"Bayside",                     {-2741.00,2175.10,0.00,-2353.10,2722.70,200.00}},
	{"Bayside Marina",              {-2353.10,2275.70,0.00,-2153.10,2475.70,200.00}},
	{"Beacon Hill",                 {-399.60,-1075.50,-1.40,-319.00,-977.50,198.50}},
	{"Blackfield",                  {964.30,1203.20,-89.00,1197.30,1403.20,110.90}},
	{"Blackfield",                  {964.30,1403.20,-89.00,1197.30,1726.20,110.90}},
	{"Blackfield Chapel",           {1375.60,596.30,-89.00,1558.00,823.20,110.90}},
	{"Blackfield Chapel",           {1325.60,596.30,-89.00,1375.60,795.00,110.90}},
	{"Blackfield Intersection",     {1197.30,1044.60,-89.00,1277.00,1163.30,110.90}},
	{"Blackfield Intersection",     {1166.50,795.00,-89.00,1375.60,1044.60,110.90}},
	{"Blackfield Intersection",     {1277.00,1044.60,-89.00,1315.30,1087.60,110.90}},
	{"Blackfield Intersection",     {1375.60,823.20,-89.00,1457.30,919.40,110.90}},
	{"Blueberry",                   {104.50,-220.10,2.30,349.60,152.20,200.00}},
	{"Blueberry",                   {19.60,-404.10,3.80,349.60,-220.10,200.00}},
	{"Blueberry Acres",             {-319.60,-220.10,0.00,104.50,293.30,200.00}},
	{"Caligula's Palace",           {2087.30,1543.20,-89.00,2437.30,1703.20,110.90}},
	{"Caligula's Palace",           {2137.40,1703.20,-89.00,2437.30,1783.20,110.90}},
	{"Calton Heights",              {-2274.10,744.10,-6.10,-1982.30,1358.90,200.00}},
	{"Chinatown",                   {-2274.10,578.30,-7.60,-2078.60,744.10,200.00}},
	{"City Hall",                   {-2867.80,277.40,-9.10,-2593.40,458.40,200.00}},
	{"Come-A-Lot",                  {2087.30,943.20,-89.00,2623.10,1203.20,110.90}},
	{"Commerce",                    {1323.90,-1842.20,-89.00,1701.90,-1722.20,110.90}},
	{"Commerce",                    {1323.90,-1722.20,-89.00,1440.90,-1577.50,110.90}},
	{"Commerce",                    {1370.80,-1577.50,-89.00,1463.90,-1384.90,110.90}},
	{"Commerce",                    {1463.90,-1577.50,-89.00,1667.90,-1430.80,110.90}},
	{"Commerce",                    {1583.50,-1722.20,-89.00,1758.90,-1577.50,110.90}},
	{"Commerce",                    {1667.90,-1577.50,-89.00,1812.60,-1430.80,110.90}},
	{"Conference Center",           {1046.10,-1804.20,-89.00,1323.90,-1722.20,110.90}},
	{"Conference Center",           {1073.20,-1842.20,-89.00,1323.90,-1804.20,110.90}},
	{"Cranberry Station",           {-2007.80,56.30,0.00,-1922.00,224.70,100.00}},
	{"Creek",                       {2749.90,1937.20,-89.00,2921.60,2669.70,110.90}},
	{"Dillimore",                   {580.70,-674.80,-9.50,861.00,-404.70,200.00}},
	{"Doherty",                     {-2270.00,-324.10,-0.00,-1794.90,-222.50,200.00}},
	{"Doherty",                     {-2173.00,-222.50,-0.00,-1794.90,265.20,200.00}},
	{"Downtown",                    {-1982.30,744.10,-6.10,-1871.70,1274.20,200.00}},
	{"Downtown",                    {-1871.70,1176.40,-4.50,-1620.30,1274.20,200.00}},
	{"Downtown",                    {-1700.00,744.20,-6.10,-1580.00,1176.50,200.00}},
	{"Downtown",                    {-1580.00,744.20,-6.10,-1499.80,1025.90,200.00}},
	{"Downtown",                    {-2078.60,578.30,-7.60,-1499.80,744.20,200.00}},
	{"Downtown",                    {-1993.20,265.20,-9.10,-1794.90,578.30,200.00}},
	{"Downtown Los Santos",         {1463.90,-1430.80,-89.00,1724.70,-1290.80,110.90}},
	{"Downtown Los Santos",         {1724.70,-1430.80,-89.00,1812.60,-1250.90,110.90}},
	{"Downtown Los Santos",         {1463.90,-1290.80,-89.00,1724.70,-1150.80,110.90}},
	{"Downtown Los Santos",         {1370.80,-1384.90,-89.00,1463.90,-1170.80,110.90}},
	{"Downtown Los Santos",         {1724.70,-1250.90,-89.00,1812.60,-1150.80,110.90}},
	{"Downtown Los Santos",         {1370.80,-1170.80,-89.00,1463.90,-1130.80,110.90}},
	{"Downtown Los Santos",         {1378.30,-1130.80,-89.00,1463.90,-1026.30,110.90}},
	{"Downtown Los Santos",         {1391.00,-1026.30,-89.00,1463.90,-926.90,110.90}},
	{"Downtown Los Santos",         {1507.50,-1385.20,110.90,1582.50,-1325.30,335.90}},
	{"East Beach",                  {2632.80,-1852.80,-89.00,2959.30,-1668.10,110.90}},
	{"East Beach",                  {2632.80,-1668.10,-89.00,2747.70,-1393.40,110.90}},
	{"East Beach",                  {2747.70,-1668.10,-89.00,2959.30,-1498.60,110.90}},
	{"East Beach",                  {2747.70,-1498.60,-89.00,2959.30,-1120.00,110.90}},
	{"East Los Santos",             {2421.00,-1628.50,-89.00,2632.80,-1454.30,110.90}},
	{"East Los Santos",             {2222.50,-1628.50,-89.00,2421.00,-1494.00,110.90}},
	{"East Los Santos",             {2266.20,-1494.00,-89.00,2381.60,-1372.00,110.90}},
	{"East Los Santos",             {2381.60,-1494.00,-89.00,2421.00,-1454.30,110.90}},
	{"East Los Santos",             {2281.40,-1372.00,-89.00,2381.60,-1135.00,110.90}},
	{"East Los Santos",             {2381.60,-1454.30,-89.00,2462.10,-1135.00,110.90}},
	{"East Los Santos",             {2462.10,-1454.30,-89.00,2581.70,-1135.00,110.90}},
	{"Easter Basin",                {-1794.90,249.90,-9.10,-1242.90,578.30,200.00}},
	{"Easter Basin",                {-1794.90,-50.00,-0.00,-1499.80,249.90,200.00}},
	{"Easter Bay Airport",          {-1499.80,-50.00,-0.00,-1242.90,249.90,200.00}},
	{"Easter Bay Airport",          {-1794.90,-730.10,-3.00,-1213.90,-50.00,200.00}},
	{"Easter Bay Airport",          {-1213.90,-730.10,0.00,-1132.80,-50.00,200.00}},
	{"Easter Bay Airport",          {-1242.90,-50.00,0.00,-1213.90,578.30,200.00}},
	{"Easter Bay Airport",          {-1213.90,-50.00,-4.50,-947.90,578.30,200.00}},
	{"Easter Bay Airport",          {-1315.40,-405.30,15.40,-1264.40,-209.50,25.40}},
	{"Easter Bay Airport",          {-1354.30,-287.30,15.40,-1315.40,-209.50,25.40}},
	{"Easter Bay Airport",          {-1490.30,-209.50,15.40,-1264.40,-148.30,25.40}},
	{"Easter Bay Chemicals",        {-1132.80,-768.00,0.00,-956.40,-578.10,200.00}},
	{"Easter Bay Chemicals",        {-1132.80,-787.30,0.00,-956.40,-768.00,200.00}},
	{"El Castillo del Diablo",      {-464.50,2217.60,0.00,-208.50,2580.30,200.00}},
	{"El Castillo del Diablo",      {-208.50,2123.00,-7.60,114.00,2337.10,200.00}},
	{"El Castillo del Diablo",      {-208.50,2337.10,0.00,8.40,2487.10,200.00}},
	{"El Corona",                   {1812.60,-2179.20,-89.00,1970.60,-1852.80,110.90}},
	{"El Corona",                   {1692.60,-2179.20,-89.00,1812.60,-1842.20,110.90}},
	{"El Quebrados",                {-1645.20,2498.50,0.00,-1372.10,2777.80,200.00}},
	{"Esplanade East",              {-1620.30,1176.50,-4.50,-1580.00,1274.20,200.00}},
	{"Esplanade East",              {-1580.00,1025.90,-6.10,-1499.80,1274.20,200.00}},
	{"Esplanade East",              {-1499.80,578.30,-79.60,-1339.80,1274.20,20.30}},
	{"Esplanade North",             {-2533.00,1358.90,-4.50,-1996.60,1501.20,200.00}},
	{"Esplanade North",             {-1996.60,1358.90,-4.50,-1524.20,1592.50,200.00}},
	{"Esplanade North",             {-1982.30,1274.20,-4.50,-1524.20,1358.90,200.00}},
	{"Fallen Tree",                 {-792.20,-698.50,-5.30,-452.40,-380.00,200.00}},
	{"Fallow Bridge",               {434.30,366.50,0.00,603.00,555.60,200.00}},
	{"Fern Ridge",                  {508.10,-139.20,0.00,1306.60,119.50,200.00}},
	{"Financial",                   {-1871.70,744.10,-6.10,-1701.30,1176.40,300.00}},
	{"Fisher's Lagoon",             {1916.90,-233.30,-100.00,2131.70,13.80,200.00}},
	{"Flint Intersection",          {-187.70,-1596.70,-89.00,17.00,-1276.60,110.90}},
	{"Flint Range",                 {-594.10,-1648.50,0.00,-187.70,-1276.60,200.00}},
	{"Fort Carson",                 {-376.20,826.30,-3.00,123.70,1220.40,200.00}},
	{"Foster Valley",               {-2270.00,-430.20,-0.00,-2178.60,-324.10,200.00}},
	{"Foster Valley",               {-2178.60,-599.80,-0.00,-1794.90,-324.10,200.00}},
	{"Foster Valley",               {-2178.60,-1115.50,0.00,-1794.90,-599.80,200.00}},
	{"Foster Valley",               {-2178.60,-1250.90,0.00,-1794.90,-1115.50,200.00}},
	{"Frederick Bridge",            {2759.20,296.50,0.00,2774.20,594.70,200.00}},
	{"Gant Bridge",                 {-2741.40,1659.60,-6.10,-2616.40,2175.10,200.00}},
	{"Gant Bridge",                 {-2741.00,1490.40,-6.10,-2616.40,1659.60,200.00}},
	{"Ganton",                      {2222.50,-1852.80,-89.00,2632.80,-1722.30,110.90}},
	{"Ganton",                      {2222.50,-1722.30,-89.00,2632.80,-1628.50,110.90}},
	{"Garcia",                      {-2411.20,-222.50,-0.00,-2173.00,265.20,200.00}},
	{"Garcia",                      {-2395.10,-222.50,-5.30,-2354.00,-204.70,200.00}},
	{"Garver Bridge",               {-1339.80,828.10,-89.00,-1213.90,1057.00,110.90}},
	{"Garver Bridge",               {-1213.90,950.00,-89.00,-1087.90,1178.90,110.90}},
	{"Garver Bridge",               {-1499.80,696.40,-179.60,-1339.80,925.30,20.30}},
	{"Glen Park",                   {1812.60,-1449.60,-89.00,1996.90,-1350.70,110.90}},
	{"Glen Park",                   {1812.60,-1100.80,-89.00,1994.30,-973.30,110.90}},
	{"Glen Park",                   {1812.60,-1350.70,-89.00,2056.80,-1100.80,110.90}},
	{"Green Palms",                 {176.50,1305.40,-3.00,338.60,1520.70,200.00}},
	{"Greenglass College",          {964.30,1044.60,-89.00,1197.30,1203.20,110.90}},
	{"Greenglass College",          {964.30,930.80,-89.00,1166.50,1044.60,110.90}},
	{"Hampton Barns",               {603.00,264.30,0.00,761.90,366.50,200.00}},
	{"Hankypanky Point",            {2576.90,62.10,0.00,2759.20,385.50,200.00}},
	{"Harry Gold Parkway",          {1777.30,863.20,-89.00,1817.30,2342.80,110.90}},
	{"Hashbury",                    {-2593.40,-222.50,-0.00,-2411.20,54.70,200.00}},
	{"Hilltop Farm",                {967.30,-450.30,-3.00,1176.70,-217.90,200.00}},
	{"Hunter Quarry",               {337.20,710.80,-115.20,860.50,1031.70,203.70}},
	{"Idlewood",                    {1812.60,-1852.80,-89.00,1971.60,-1742.30,110.90}},
	{"Idlewood",                    {1812.60,-1742.30,-89.00,1951.60,-1602.30,110.90}},
	{"Idlewood",                    {1951.60,-1742.30,-89.00,2124.60,-1602.30,110.90}},
	{"Idlewood",                    {1812.60,-1602.30,-89.00,2124.60,-1449.60,110.90}},
	{"Idlewood",                    {2124.60,-1742.30,-89.00,2222.50,-1494.00,110.90}},
	{"Idlewood",                    {1971.60,-1852.80,-89.00,2222.50,-1742.30,110.90}},
	{"Jefferson",                   {1996.90,-1449.60,-89.00,2056.80,-1350.70,110.90}},
	{"Jefferson",                   {2124.60,-1494.00,-89.00,2266.20,-1449.60,110.90}},
	{"Jefferson",                   {2056.80,-1372.00,-89.00,2281.40,-1210.70,110.90}},
	{"Jefferson",                   {2056.80,-1210.70,-89.00,2185.30,-1126.30,110.90}},
	{"Jefferson",                   {2185.30,-1210.70,-89.00,2281.40,-1154.50,110.90}},
	{"Jefferson",                   {2056.80,-1449.60,-89.00,2266.20,-1372.00,110.90}},
	{"Julius Thruway East",         {2623.10,943.20,-89.00,2749.90,1055.90,110.90}},
	{"Julius Thruway East",         {2685.10,1055.90,-89.00,2749.90,2626.50,110.90}},
	{"Julius Thruway East",         {2536.40,2442.50,-89.00,2685.10,2542.50,110.90}},
	{"Julius Thruway East",         {2625.10,2202.70,-89.00,2685.10,2442.50,110.90}},
	{"Julius Thruway North",        {2498.20,2542.50,-89.00,2685.10,2626.50,110.90}},
	{"Julius Thruway North",        {2237.40,2542.50,-89.00,2498.20,2663.10,110.90}},
	{"Julius Thruway North",        {2121.40,2508.20,-89.00,2237.40,2663.10,110.90}},
	{"Julius Thruway North",        {1938.80,2508.20,-89.00,2121.40,2624.20,110.90}},
	{"Julius Thruway North",        {1534.50,2433.20,-89.00,1848.40,2583.20,110.90}},
	{"Julius Thruway North",        {1848.40,2478.40,-89.00,1938.80,2553.40,110.90}},
	{"Julius Thruway North",        {1704.50,2342.80,-89.00,1848.40,2433.20,110.90}},
	{"Julius Thruway North",        {1377.30,2433.20,-89.00,1534.50,2507.20,110.90}},
	{"Julius Thruway South",        {1457.30,823.20,-89.00,2377.30,863.20,110.90}},
	{"Julius Thruway South",        {2377.30,788.80,-89.00,2537.30,897.90,110.90}},
	{"Julius Thruway West",         {1197.30,1163.30,-89.00,1236.60,2243.20,110.90}},
	{"Julius Thruway West",         {1236.60,2142.80,-89.00,1297.40,2243.20,110.90}},
	{"Juniper Hill",                {-2533.00,578.30,-7.60,-2274.10,968.30,200.00}},
	{"Juniper Hollow",              {-2533.00,968.30,-6.10,-2274.10,1358.90,200.00}},
	{"K.A.C.C. Military Fuels",     {2498.20,2626.50,-89.00,2749.90,2861.50,110.90}},
	{"Kincaid Bridge",              {-1339.80,599.20,-89.00,-1213.90,828.10,110.90}},
	{"Kincaid Bridge",              {-1213.90,721.10,-89.00,-1087.90,950.00,110.90}},
	{"Kincaid Bridge",              {-1087.90,855.30,-89.00,-961.90,986.20,110.90}},
	{"King's",                      {-2329.30,458.40,-7.60,-1993.20,578.30,200.00}},
	{"King's",                      {-2411.20,265.20,-9.10,-1993.20,373.50,200.00}},
	{"King's",                      {-2253.50,373.50,-9.10,-1993.20,458.40,200.00}},
	{"LVA Freight Depot",           {1457.30,863.20,-89.00,1777.40,1143.20,110.90}},
	{"LVA Freight Depot",           {1375.60,919.40,-89.00,1457.30,1203.20,110.90}},
	{"LVA Freight Depot",           {1277.00,1087.60,-89.00,1375.60,1203.20,110.90}},
	{"LVA Freight Depot",           {1315.30,1044.60,-89.00,1375.60,1087.60,110.90}},
	{"LVA Freight Depot",           {1236.60,1163.40,-89.00,1277.00,1203.20,110.90}},
	{"Las Barncas",               {-926.10,1398.70,-3.00,-719.20,1634.60,200.00}},
	{"Las Brujas",                  {-365.10,2123.00,-3.00,-208.50,2217.60,200.00}},
	{"Las Colinas",                 {1994.30,-1100.80,-89.00,2056.80,-920.80,110.90}},
	{"Las Colinas",                 {2056.80,-1126.30,-89.00,2126.80,-920.80,110.90}},
	{"Las Colinas",                 {2185.30,-1154.50,-89.00,2281.40,-934.40,110.90}},
	{"Las Colinas",                 {2126.80,-1126.30,-89.00,2185.30,-934.40,110.90}},
	{"Las Colinas",                 {2747.70,-1120.00,-89.00,2959.30,-945.00,110.90}},
	{"Las Colinas",                 {2632.70,-1135.00,-89.00,2747.70,-945.00,110.90}},
	{"Las Colinas",                 {2281.40,-1135.00,-89.00,2632.70,-945.00,110.90}},
	{"Las Payasadas",               {-354.30,2580.30,2.00,-133.60,2816.80,200.00}},
	{"Las Venturas Airport",        {1236.60,1203.20,-89.00,1457.30,1883.10,110.90}},
	{"Las Venturas Airport",        {1457.30,1203.20,-89.00,1777.30,1883.10,110.90}},
	{"Las Venturas Airport",        {1457.30,1143.20,-89.00,1777.40,1203.20,110.90}},
	{"Las Venturas Airport",        {1515.80,1586.40,-12.50,1729.90,1714.50,87.50}},
	{"Last Dime Motel",             {1823.00,596.30,-89.00,1997.20,823.20,110.90}},
	{"Leafy Hollow",                {-1166.90,-1856.00,0.00,-815.60,-1602.00,200.00}},
	{"Liberty City",                {-1000.00,400.00,1300.00,-700.00,600.00,1400.00}},
	{"Lil' Probe Inn",              {-90.20,1286.80,-3.00,153.80,1554.10,200.00}},
	{"Linden Side",                 {2749.90,943.20,-89.00,2923.30,1198.90,110.90}},
	{"Linden Station",              {2749.90,1198.90,-89.00,2923.30,1548.90,110.90}},
	{"Linden Station",              {2811.20,1229.50,-39.50,2861.20,1407.50,60.40}},
	{"Little Mexico",               {1701.90,-1842.20,-89.00,1812.60,-1722.20,110.90}},
	{"Little Mexico",               {1758.90,-1722.20,-89.00,1812.60,-1577.50,110.90}},
	{"Los Flores",                  {2581.70,-1454.30,-89.00,2632.80,-1393.40,110.90}},
	{"Los Flores",                  {2581.70,-1393.40,-89.00,2747.70,-1135.00,110.90}},
	{"Los Santos International",    {1249.60,-2394.30,-89.00,1852.00,-2179.20,110.90}},
	{"Los Santos International",    {1852.00,-2394.30,-89.00,2089.00,-2179.20,110.90}},
	{"Los Santos International",    {1382.70,-2730.80,-89.00,2201.80,-2394.30,110.90}},
	{"Los Santos International",    {1974.60,-2394.30,-39.00,2089.00,-2256.50,60.90}},
	{"Los Santos International",    {1400.90,-2669.20,-39.00,2189.80,-2597.20,60.90}},
	{"Los Santos International",    {2051.60,-2597.20,-39.00,2152.40,-2394.30,60.90}},
	{"Marina",                      {647.70,-1804.20,-89.00,851.40,-1577.50,110.90}},
	{"Marina",                      {647.70,-1577.50,-89.00,807.90,-1416.20,110.90}},
	{"Marina",                      {807.90,-1577.50,-89.00,926.90,-1416.20,110.90}},
	{"Market",                      {787.40,-1416.20,-89.00,1072.60,-1310.20,110.90}},
	{"Market",                      {952.60,-1310.20,-89.00,1072.60,-1130.80,110.90}},
	{"Market",                      {1072.60,-1416.20,-89.00,1370.80,-1130.80,110.90}},
	{"Market",                      {926.90,-1577.50,-89.00,1370.80,-1416.20,110.90}},
	{"Market Station",              {787.40,-1410.90,-34.10,866.00,-1310.20,65.80}},
	{"Martin Bridge",               {-222.10,293.30,0.00,-122.10,476.40,200.00}},
	{"Missionary Hill",             {-2994.40,-811.20,0.00,-2178.60,-430.20,200.00}},
	{"Montgomery",                  {1119.50,119.50,-3.00,1451.40,493.30,200.00}},
	{"Montgomery",                  {1451.40,347.40,-6.10,1582.40,420.80,200.00}},
	{"Montgomery Intersection",     {1546.60,208.10,0.00,1745.80,347.40,200.00}},
	{"Montgomery Intersection",     {1582.40,347.40,0.00,1664.60,401.70,200.00}},
	{"Mulholland",                  {1414.00,-768.00,-89.00,1667.60,-452.40,110.90}},
	{"Mulholland",                  {1281.10,-452.40,-89.00,1641.10,-290.90,110.90}},
	{"Mulholland",                  {1269.10,-768.00,-89.00,1414.00,-452.40,110.90}},
	{"Mulholland",                  {1357.00,-926.90,-89.00,1463.90,-768.00,110.90}},
	{"Mulholland",                  {1318.10,-910.10,-89.00,1357.00,-768.00,110.90}},
	{"Mulholland",                  {1169.10,-910.10,-89.00,1318.10,-768.00,110.90}},
	{"Mulholland",                  {768.60,-954.60,-89.00,952.60,-860.60,110.90}},
	{"Mulholland",                  {687.80,-860.60,-89.00,911.80,-768.00,110.90}},
	{"Mulholland",                  {737.50,-768.00,-89.00,1142.20,-674.80,110.90}},
	{"Mulholland",                  {1096.40,-910.10,-89.00,1169.10,-768.00,110.90}},
	{"Mulholland",                  {952.60,-937.10,-89.00,1096.40,-860.60,110.90}},
	{"Mulholland",                  {911.80,-860.60,-89.00,1096.40,-768.00,110.90}},
	{"Mulholland",                  {861.00,-674.80,-89.00,1156.50,-600.80,110.90}},
	{"Mulholland Intersection",     {1463.90,-1150.80,-89.00,1812.60,-768.00,110.90}},
	{"North Rock",                  {2285.30,-768.00,0.00,2770.50,-269.70,200.00}},
	{"Ocean Docks",                 {2373.70,-2697.00,-89.00,2809.20,-2330.40,110.90}},
	{"Ocean Docks",                 {2201.80,-2418.30,-89.00,2324.00,-2095.00,110.90}},
	{"Ocean Docks",                 {2324.00,-2302.30,-89.00,2703.50,-2145.10,110.90}},
	{"Ocean Docks",                 {2089.00,-2394.30,-89.00,2201.80,-2235.80,110.90}},
	{"Ocean Docks",                 {2201.80,-2730.80,-89.00,2324.00,-2418.30,110.90}},
	{"Ocean Docks",                 {2703.50,-2302.30,-89.00,2959.30,-2126.90,110.90}},
	{"Ocean Docks",                 {2324.00,-2145.10,-89.00,2703.50,-2059.20,110.90}},
	{"Ocean Flats",                 {-2994.40,277.40,-9.10,-2867.80,458.40,200.00}},
	{"Ocean Flats",                 {-2994.40,-222.50,-0.00,-2593.40,277.40,200.00}},
	{"Ocean Flats",                 {-2994.40,-430.20,-0.00,-2831.80,-222.50,200.00}},
	{"Octane Springs",              {338.60,1228.50,0.00,664.30,1655.00,200.00}},
	{"Old Venturas Strip",          {2162.30,2012.10,-89.00,2685.10,2202.70,110.90}},
	{"Palisades",                   {-2994.40,458.40,-6.10,-2741.00,1339.60,200.00}},
	{"Palomino Creek",              {2160.20,-149.00,0.00,2576.90,228.30,200.00}},
	{"Paradiso",                    {-2741.00,793.40,-6.10,-2533.00,1268.40,200.00}},
	{"Pershing Square",             {1440.90,-1722.20,-89.00,1583.50,-1577.50,110.90}},
	{"Pilgrim",                     {2437.30,1383.20,-89.00,2624.40,1783.20,110.90}},
	{"Pilgrim",                     {2624.40,1383.20,-89.00,2685.10,1783.20,110.90}},
	{"Pilson Intersection",         {1098.30,2243.20,-89.00,1377.30,2507.20,110.90}},
	{"Pirates in Men's Pants",      {1817.30,1469.20,-89.00,2027.40,1703.20,110.90}},
	{"Playa del Seville",           {2703.50,-2126.90,-89.00,2959.30,-1852.80,110.90}},
	{"Prickle Pine",                {1534.50,2583.20,-89.00,1848.40,2863.20,110.90}},
	{"Prickle Pine",                {1117.40,2507.20,-89.00,1534.50,2723.20,110.90}},
	{"Prickle Pine",                {1848.40,2553.40,-89.00,1938.80,2863.20,110.90}},
	{"Prickle Pine",                {1938.80,2624.20,-89.00,2121.40,2861.50,110.90}},
	{"Queens",                      {-2533.00,458.40,0.00,-2329.30,578.30,200.00}},
	{"Queens",                      {-2593.40,54.70,0.00,-2411.20,458.40,200.00}},
	{"Queens",                      {-2411.20,373.50,0.00,-2253.50,458.40,200.00}},
	{"Randolph Industrial Estate",  {1558.00,596.30,-89.00,1823.00,823.20,110.90}},
	{"Redsands East",               {1817.30,2011.80,-89.00,2106.70,2202.70,110.90}},
	{"Redsands East",               {1817.30,2202.70,-89.00,2011.90,2342.80,110.90}},
	{"Redsands East",               {1848.40,2342.80,-89.00,2011.90,2478.40,110.90}},
	{"Redsands West",               {1236.60,1883.10,-89.00,1777.30,2142.80,110.90}},
	{"Redsands West",               {1297.40,2142.80,-89.00,1777.30,2243.20,110.90}},
	{"Redsands West",               {1377.30,2243.20,-89.00,1704.50,2433.20,110.90}},
	{"Redsands West",               {1704.50,2243.20,-89.00,1777.30,2342.80,110.90}},
	{"Regular Tom",                 {-405.70,1712.80,-3.00,-276.70,1892.70,200.00}},
	{"Richman",                     {647.50,-1118.20,-89.00,787.40,-954.60,110.90}},
	{"Richman",                     {647.50,-954.60,-89.00,768.60,-860.60,110.90}},
	{"Richman",                     {225.10,-1369.60,-89.00,334.50,-1292.00,110.90}},
	{"Richman",                     {225.10,-1292.00,-89.00,466.20,-1235.00,110.90}},
	{"Richman",                     {72.60,-1404.90,-89.00,225.10,-1235.00,110.90}},
	{"Richman",                     {72.60,-1235.00,-89.00,321.30,-1008.10,110.90}},
	{"Richman",                     {321.30,-1235.00,-89.00,647.50,-1044.00,110.90}},
	{"Richman",                     {321.30,-1044.00,-89.00,647.50,-860.60,110.90}},
	{"Richman",                     {321.30,-860.60,-89.00,687.80,-768.00,110.90}},
	{"Richman",                     {321.30,-768.00,-89.00,700.70,-674.80,110.90}},
	{"Robada Intersection",         {-1119.00,1178.90,-89.00,-862.00,1351.40,110.90}},
	{"Roca Escalante",              {2237.40,2202.70,-89.00,2536.40,2542.50,110.90}},
	{"Roca Escalante",              {2536.40,2202.70,-89.00,2625.10,2442.50,110.90}},
	{"Rockshore East",              {2537.30,676.50,-89.00,2902.30,943.20,110.90}},
	{"Rockshore West",              {1997.20,596.30,-89.00,2377.30,823.20,110.90}},
	{"Rockshore West",              {2377.30,596.30,-89.00,2537.30,788.80,110.90}},
	{"Rodeo",                       {72.60,-1684.60,-89.00,225.10,-1544.10,110.90}},
	{"Rodeo",                       {72.60,-1544.10,-89.00,225.10,-1404.90,110.90}},
	{"Rodeo",                       {225.10,-1684.60,-89.00,312.80,-1501.90,110.90}},
	{"Rodeo",                       {225.10,-1501.90,-89.00,334.50,-1369.60,110.90}},
	{"Rodeo",                       {334.50,-1501.90,-89.00,422.60,-1406.00,110.90}},
	{"Rodeo",                       {312.80,-1684.60,-89.00,422.60,-1501.90,110.90}},
	{"Rodeo",                       {422.60,-1684.60,-89.00,558.00,-1570.20,110.90}},
	{"Rodeo",                       {558.00,-1684.60,-89.00,647.50,-1384.90,110.90}},
	{"Rodeo",                       {466.20,-1570.20,-89.00,558.00,-1385.00,110.90}},
	{"Rodeo",                       {422.60,-1570.20,-89.00,466.20,-1406.00,110.90}},
	{"Rodeo",                       {466.20,-1385.00,-89.00,647.50,-1235.00,110.90}},
	{"Rodeo",                       {334.50,-1406.00,-89.00,466.20,-1292.00,110.90}},
	{"Royal Casino",                {2087.30,1383.20,-89.00,2437.30,1543.20,110.90}},
	{"San Andreas Sound",           {2450.30,385.50,-100.00,2759.20,562.30,200.00}},
	{"Santa Flora",                 {-2741.00,458.40,-7.60,-2533.00,793.40,200.00}},
	{"Santa Maria Beach",           {342.60,-2173.20,-89.00,647.70,-1684.60,110.90}},
	{"Santa Maria Beach",           {72.60,-2173.20,-89.00,342.60,-1684.60,110.90}},
	{"Shady Cabin",                 {-1632.80,-2263.40,-3.00,-1601.30,-2231.70,200.00}},
	{"Shady Creeks",                {-1820.60,-2643.60,-8.00,-1226.70,-1771.60,200.00}},
	{"Shady Creeks",                {-2030.10,-2174.80,-6.10,-1820.60,-1771.60,200.00}},
	{"Sobell Rail Yards",           {2749.90,1548.90,-89.00,2923.30,1937.20,110.90}},
	{"Spinybed",                    {2121.40,2663.10,-89.00,2498.20,2861.50,110.90}},
	{"Starfish Casino",             {2437.30,1783.20,-89.00,2685.10,2012.10,110.90}},
	{"Starfish Casino",             {2437.30,1858.10,-39.00,2495.00,1970.80,60.90}},
	{"Starfish Casino",             {2162.30,1883.20,-89.00,2437.30,2012.10,110.90}},
	{"Temple",                      {1252.30,-1130.80,-89.00,1378.30,-1026.30,110.90}},
	{"Temple",                      {1252.30,-1026.30,-89.00,1391.00,-926.90,110.90}},
	{"Temple",                      {1252.30,-926.90,-89.00,1357.00,-910.10,110.90}},
	{"Temple",                      {952.60,-1130.80,-89.00,1096.40,-937.10,110.90}},
	{"Temple",                      {1096.40,-1130.80,-89.00,1252.30,-1026.30,110.90}},
	{"Temple",                      {1096.40,-1026.30,-89.00,1252.30,-910.10,110.90}},
	{"The Camel's Toe",             {2087.30,1203.20,-89.00,2640.40,1383.20,110.90}},
	{"The Clown's Pocket",          {2162.30,1783.20,-89.00,2437.30,1883.20,110.90}},
	{"The Emerald Isle",            {2011.90,2202.70,-89.00,2237.40,2508.20,110.90}},
	{"The Farm",                    {-1209.60,-1317.10,114.90,-908.10,-787.30,251.90}},
	{"The Four Dragons Casino",     {1817.30,863.20,-89.00,2027.30,1083.20,110.90}},
	{"The High Roller",             {1817.30,1283.20,-89.00,2027.30,1469.20,110.90}},
	{"The Mako Span",               {1664.60,401.70,0.00,1785.10,567.20,200.00}},
	{"The Panopticon",              {-947.90,-304.30,-1.10,-319.60,327.00,200.00}},
	{"The Pink Swan",               {1817.30,1083.20,-89.00,2027.30,1283.20,110.90}},
	{"The Sherman Dam",             {-968.70,1929.40,-3.00,-481.10,2155.20,200.00}},
	{"The Strip",                   {2027.40,863.20,-89.00,2087.30,1703.20,110.90}},
	{"The Strip",                   {2106.70,1863.20,-89.00,2162.30,2202.70,110.90}},
	{"The Strip",                   {2027.40,1783.20,-89.00,2162.30,1863.20,110.90}},
	{"The Strip",                   {2027.40,1703.20,-89.00,2137.40,1783.20,110.90}},
	{"The Visage",                  {1817.30,1863.20,-89.00,2106.70,2011.80,110.90}},
	{"The Visage",                  {1817.30,1703.20,-89.00,2027.40,1863.20,110.90}},
	{"Unity Station",               {1692.60,-1971.80,-20.40,1812.60,-1932.80,79.50}},
	{"Valle Ocultado",              {-936.60,2611.40,2.00,-715.90,2847.90,200.00}},
	{"Verdant Bluffs",              {930.20,-2488.40,-89.00,1249.60,-2006.70,110.90}},
	{"Verdant Bluffs",              {1073.20,-2006.70,-89.00,1249.60,-1842.20,110.90}},
	{"Verdant Bluffs",              {1249.60,-2179.20,-89.00,1692.60,-1842.20,110.90}},
	{"Verdant Meadows",             {37.00,2337.10,-3.00,435.90,2677.90,200.00}},
	{"Verona Beach",                {647.70,-2173.20,-89.00,930.20,-1804.20,110.90}},
	{"Verona Beach",                {930.20,-2006.70,-89.00,1073.20,-1804.20,110.90}},
	{"Verona Beach",                {851.40,-1804.20,-89.00,1046.10,-1577.50,110.90}},
	{"Verona Beach",                {1161.50,-1722.20,-89.00,1323.90,-1577.50,110.90}},
	{"Verona Beach",                {1046.10,-1722.20,-89.00,1161.50,-1577.50,110.90}},
	{"Vinewood",                    {787.40,-1310.20,-89.00,952.60,-1130.80,110.90}},
	{"Vinewood",                    {787.40,-1130.80,-89.00,952.60,-954.60,110.90}},
	{"Vinewood",                    {647.50,-1227.20,-89.00,787.40,-1118.20,110.90}},
	{"Vinewood",                    {647.70,-1416.20,-89.00,787.40,-1227.20,110.90}},
	{"Whitewood Estates",           {883.30,1726.20,-89.00,1098.30,2507.20,110.90}},
	{"Whitewood Estates",           {1098.30,1726.20,-89.00,1197.30,2243.20,110.90}},
	{"Willowfield",                 {1970.60,-2179.20,-89.00,2089.00,-1852.80,110.90}},
	{"Willowfield",                 {2089.00,-2235.80,-89.00,2201.80,-1989.90,110.90}},
	{"Willowfield",                 {2089.00,-1989.90,-89.00,2324.00,-1852.80,110.90}},
	{"Willowfield",                 {2201.80,-2095.00,-89.00,2324.00,-1989.90,110.90}},
	{"Willowfield",                 {2541.70,-1941.40,-89.00,2703.50,-1852.80,110.90}},
	{"Willowfield",                 {2324.00,-2059.20,-89.00,2541.70,-1852.80,110.90}},
	{"Willowfield",                 {2541.70,-2059.20,-89.00,2703.50,-1941.40,110.90}},
	{"Yellow Bell Station",         {1377.40,2600.40,-21.90,1492.40,2687.30,78.00}},
	// Main Zones
	{"Los Santos",                  {44.60,-2892.90,-242.90,2997.00,-768.00,900.00}},
	{"Las Venturas",                {869.40,596.30,-242.90,2997.00,2993.80,900.00}},
	{"Bone County",                 {-480.50,596.30,-242.90,869.40,2993.80,900.00}},
	{"Tierra Robada",               {-2997.40,1659.60,-242.90,-480.50,2993.80,900.00}},
	{"Tierra Robada",               {-1213.90,596.30,-242.90,-480.50,1659.60,900.00}},
	{"San Fierro",                  {-2997.40,-1115.50,-242.90,-1213.90,1659.60,900.00}},
	{"Red County",                  {-1213.90,-768.00,-242.90,2997.00,596.30,900.00}},
	{"Flint County",                {-1213.90,-2892.90,-242.90,44.60,-768.00,900.00}},
	{"Whetstone",                   {-2997.40,-2892.90,-242.90,-1213.90,-1115.50,900.00}}
};
//
#define MAX_PARKCARS 40
enum tcInfo
{
	tcID,
	tcPID,
	tcModel,
	tcFuel,
	tcStatus,
Float:tcX,
Float:tcY,
Float:tcZ,
Float:tcFa,
	tcVehicle,
};
new BizzCarsPark[MAX_PARKCARS][tcInfo];
//
new jobproduct[2],fuelcar[2];
new ProductTime[MAX_PLAYERS];
new FuelTime[MAX_PLAYERS];
new LoadProductKG[MAX_VEHICLES];
#define MAX_PRODUCT 100
enum pinfo
{
	id,
	pName[MAX_PLAYER_NAME],
	pBizzid,
	pPrice,
	pTill,
bool:pStatus,
Text3D:pText3D
};
new ProductInfo[MAX_PRODUCT][pinfo];
#define MAX_FUEL 100
enum fuel_info
{
	id,
	pName[MAX_PLAYER_NAME],
	pBizzid,
	pPrice,
	pTill,
bool:pStatus,
Text3D:pText3D
};
new FuelInfo[MAX_FUEL][fuel_info];
enum pInfo
{
	pID,
	pName_str[MAX_PLAYER_NAME],
	pPassword[128],
	pEmail[64],
	pTxt,
	pPutMoney,
	pAdmLevel,
	pHelpLevel,
	pAdmKey[32],
	pMuted,
	pWatch,
	pPoolWon,
	pSprunk,
	pFoods[16],
	pFood[3],
	pItems[32],
	pItem[5],
	pInvSlots[60],
	pInvSlot[20],
	pInvKols[80],
	pInvKol[20],
	pPhones[16],
	pPhone[3],
	pAptechka,
	pMask,
	pCash,
	pBank,
	pSex,
Float:pHeal,
Float:pArmur,
	//
	pGuns[40],
	pGun[13],
	pAmmos[160],
	pAmmo[13],
	//
	pObez,
	pRegIp[16],
	pConnectIp[16],
	pSkin,
	pFracSkin,
	pLevel,
	pExp,
	pLeader,
	pMember,
	pRank,
	pWarn,
	pBan,
	pLics[16],
	pLic[5],
	pGunSkill[6],
	pGunSkills[60],
	pPayCheck,
	pJob,
	pDutyJob,
	pJobExps[12],
	pJobExp[4],
	pArmyBilet,
	pWanted,
	pJail,
	pJailTime,
	//
	pStuff[30],
	pStuf[3],
	pGrains,
	pHouseMoney,
	pHouseDrugs,
	//
	pSpawn,
	pHotel,
	pHotelNumber,
	pHunger,
	//
	pBlock,
Float: pPos[4],
	pOldWarning,
	pSms[64],
	pCrimes, // Криминал
	pWantedWho,
	pWantedReason,
	pWantedTime,
	pNews,
	// Сохранение Шахта, грузчики, Лесопилка
	pJobAmounts[30],
	pJobAmount[3],
	//
	pWheels,
	pSpoilers,
	pHydraulics,
	pHBumper,
	pBBumper,
	pNitro,
	pNeons,
Float:pShield,
	//
	pSmoke,
	pBelay,
	pSpining,
	pDonateCash,
	//
	pRegDate,
	pCars[3],
	pPremium
};
new PI[MAX_PLAYERS][pInfo];
//
#define MAX_ADVERT 100
enum aInfo
{
	id,
	aText[128],
	aName[MAX_PLAYER_NAME],
	aPhone,
};
new AI[MAX_ADVERT][aInfo];
//
enum VehicleInfo
{
Float:vPos[4],
	vID,
Float:vFuel,
	vEngine,
	vDoors,
	vLoaded,
	vLights,
	vFrac,
	vJob,
	vColor1,
	vColor2,
bool:pText
}
new VehInfo[MAX_VEHICLES][VehicleInfo];

new lotto_var[MAX_PLAYERS];
new GetPlayerOption[MAX_PLAYERS];
new
	bool:flying[MAX_PLAYERS],
	bool:BunnyUse[MAX_PLAYERS],
	bool:Damaged[MAX_PLAYERS] = false,
	bool:Spawned[MAX_PLAYERS] = false,
	bool:UsingShield[MAX_PLAYERS],
	bool:Scene_Created,
	bool:Derby_Created,
	bool:UseEnter[MAX_PLAYERS],
	bool:unoccupied[MAX_VEHICLES],
	bool:LoadCarm[MAX_VEHICLES],
	bool:UnLoadCarm[MAX_VEHICLES],
	bool:Phone[MAX_PLAYERS],
	bool:EtherCalled[MAX_PLAYERS],
	bool:Ether[MAX_PLAYERS],
	bool:EtherLive[MAX_PLAYERS],
	bool:EtherCall[2],
	bool:EtherSms[2],
	bool:gPDCamStatus[3],
	bool:PPC[MAX_PLAYERS],
	bool:StatusMedHeal[15],
	bool:Engine[MAX_VEHICLES],
	bool:Bonnets[MAX_VEHICLES],
	bool:Boots[MAX_VEHICLES],
	bool:Light[MAX_VEHICLES],
	bool:IsLocked[MAX_VEHICLES],
	bool:VehicleCreate[MAX_VEHICLES],
	bool:AdminLogged[MAX_PLAYERS],
	bool:BanCar[MAX_VEHICLES],
	bool:animload[MAX_PLAYERS],
	bool:animsload[MAX_PLAYERS],
	bool:PlayerCuffed[MAX_PLAYERS]
;
